'''
คำอธิบาย
นายเอ คิดโจทย์คณิตศาสตร์ขึ้นมาจำนวน 1,234 ข้อ โดยให้นายบี เป็นคนทำ
โดยนายบี จะทำโจทย์ตั้งแต่วันที่ n ถึงวันที่ m ในวันแรกที่เริ่มทำโจทย์นั้นนายบี จะทำโจทย์ทั้งหมด k ข้อ
และในแต่ละวันนายบี จะทำโจทย์มากขึ้นวันละ A ข้อ

รูปเเบบ Input
บรรทัดเดียว รับจำนวนเต็มบวก n, m, k และ A ตามลำดับ

รูปเเบบ Output
บรรทัดเดียว มีสองกรณีคือ
1.สามารถทำโจทย์ได้ทั้งหมดให้แสดงคำว่า "YES"
2.ไม่สามารถทำโจทย์ทั้งหมดได้ทันเวลาให้แสดงจำนวนข้อที่เหลือ

ตัวอย่างที่1
Input:
1 2 3 4

Output:
1224

ตัวอย่างที่2
Input:
1 5 10 200

Output:
YES

ตัวอย่างที่3
Input:
1 5 6 20

Output:
1004
'''


n, m, k, A = list(map(int, input().split()))

day = m - n

exam = 0
for i in range(day+1):
  exam += A*(i) +k 
  
if exam >=1234:
  print("YES")
else:
  print(1234 - exam)
