'''
คำอธิบาย
ให้รับจำนวนเต็มมาเรื่อยๆ ซึ่งเลขเหล่านั้นคือสมาชิกในเซต โดยหากพบว่าสมาชิกในเซตนั้นที่ซ้ำกันนับเป็นแค่ตัวเดียว ตัวอย่าง A = {1,1,1,1,2,2,3} จะได้ว่าสมาชิก A มีเพียงแค่ 3 ตัว คือ 1 , 2 , 3

รูปเเบบ Input
บรรทัดที่ 1 รับชุดตัวเลขจำนวนเต็มมาเรื่อยๆจนกว่าจะพิมพ์ 0

รูปแบบ Output
บรรทัดที่ 1 จำนวนสมาชิกของเซตนั้นเป็นจำนวนเต็ม

ข้อจำกัด
เลขที่รับมาสามารถมั่นใจได้อย่างแน่นอนว่าจะไม่เกิน 10,000 ตัว

ตัวอย่างที่ 1
ข้อมูลขาเข้า
1 2 1 2 3 1 2 1 0

ผลลัพธ์
3

ตัวอย่างที่ 2
ข้อมูลขาเข้า
1 2 3 1 2 3 4 5 2 3 4 5 3 2 1 4 2 1 0

ผลลัพธ์
5

ตัวอย่างที่ 3
ข้อมูลขาเข้า
9 5 6 6 6 4 1 1 4 2 3 2 4 7 8 2 3 5 5 5 9 1 2 3 4 0

ผลลัพธ์
9
'''

text_in = input().split(" ")[:-1]

result = len(set(map(lambda x: int(x), text_in)))

print(result)
