'''
คำอธิบาย
ระดับความยาก 1 ดาว
นิยามลำดับสลับซับซ้อน คือลำดับที่มีสมาชิก 3 ตัว ที่ตัวกลางมีค่ามากกว่าตัวซ้ายและตัวขวา หรือตัวกลางมีค่าน้อยกว่าตัวซ้ายและตัวขวา
งานของคุณ มีจำนวนเต็ม 3 จำนวนคือ a b c คุณสามารถเรียง a b c ยังไงก็ได้ให้เป็นลำดับสลับซับซ้อนได้หรือไม่?

รูปเเบบ Input
มีบรรทัดเดียว รับค่าจำนวนเต็ม a b c โดย -(10^9)<=a,b,c<=10^9

รูปเเบบ Output
มีบรรทัดเดียว ถ้าสามารถทำเป็นลำดับสลับซับซ้อนได้ให้ตอบ YES ไม่เช่นนั้นให้ตอบ NO

ข้อจำกัด
a,b,c เป็นจำนวนเต็ม และ -(10^9)<=a,b,c<=10^9

คำอธิบายตัวอย่าง
ตัวอย่างที่ 1 คุณสามารถสลับเลข 3 กับ 2 ให้เป็น 3 2 5 ซึ่งเป็นลำดับสลับซับซ้อนได้
ตัวอย่างที่ 2 คุณไม่ต้องสลับเลขใดๆ เลย ก็เป็นลำดับสลับซับซ้อนได้
ตัวอย่างที่ 3 ไม่ว่าสลับเลขยังไง ก็ไม่สามารถเป็นลำดับสลับซับซ้อนได้

ข้อมูลเพิ่มเติมเกี่ยวกับชุดทดสอบ
ปัญหาย่อยที่ 1 (2 ชุดทดสอบ) 1<=a,b,c<=10
ปัญหาย่อยที่ 2 (2 ชุดทดสอบ) a=b=c
ปัญหาย่อยที่ 3 (2 ชุดทดสอบ) 1<=a,b,c<=10^9
ปัญหาย่อยที่ 4 (2 ชุดทดสอบ) ไม่มีเงื่อนไขเพิ่มเติม

ตัวอย่างที่1
Input:
2 3 5

Output:
YES

ตัวอย่างที่2
Input:
5 8 2

Output:
YES

ตัวอย่างที่3
Input:
4 4 4

Output:
NO
'''
a, b, c = list(map(int, input().split(" ")))

if a >= 10**9 or a <= 10**-9:
  print("NO")
elif b >= 10**9  or b <= 10**-9:
  print("NO")
elif c >= 10**9  or c <= 10**-9:
  print("NO")
elif a == b == c :
  print("NO")
else:
  print("YES")
