'''
คำอธิบาย
เมื่อ Y ปีที่แล้วนายA แก่กว่านายB เป็นจำนวน M เท่า และปัจจุบันนายA แก่กว่านายB เป็นจำนวน N ปี ถามว่าตอนนี้ทั้งคู่อายุเท่าไร

รูปเเบบ Input
จำนวนเต็ม 3 จำนวน N M Y

รูปเเบบ Output
บรรทัดแรก ค่า A B เป็นอายุของนายA และนายB

ข้อจำกัด
0<B<A<100,000
0<N,M,Y<100,000

ตัวอย่างที่1
Input:
1 2 3

Output:
5 4
2

ตัวอย่างที่2
Input:
6 2 8

Output:
20 14
'''
N, M, Y = input().split(" ")

N = int(N)
M = int(M)
Y = int(Y)

B = ((M*Y) - Y +N)/(M-1)
A = B + N

print(int(A), int(B))
