'''
คำอธิบาย
ต้องการหาผลลัพธ์ของรากที่สอง (square root) ของตัวเลขกำลังสองสมบูรณ์ใดๆ ก็ตามที่ลงท้ายด้วย 25
โดยที่เลขใดๆ ที่เป็นกำลังสองสมบูรณ์ที่ลงท้ายด้วย 25 ตัวเลขด้านหน้าเลข 25 จะเกิดจาก i * (i+1) เช่น
5625 ตัวด้านหน้าเลข 25 คือ 56 ดังนั้น i * (i + 1) = 56 จะได้ว่า i = 7 เนื่องจาก 7 * (7 + 1) = 56
1225 ตัวด้านหน้าเลข 25 คือ 12 ดังนั้น i * (i + 1) = 12 จะได้ว่า i = 3 เนื่องจาก 3 * (3 + 1) = 12
นี่แหละความมหัศจรรย์คณิตศาสตร์

รูปเเบบ Input
เป็นตัวเลขที่เป็นกำลังสองสมบูรณ์ โดยรับค่า n
โดยเขียนเป็นอสมการได้ว่า 0 < n <= 100000

รูปเเบบ Output
เป็นค่า Square Root หรือรากที่สองของ Input โดยต้องเป็นจำนวนเต็มถ้า Input เป็นจำนวนกำลังสองสมบูรณ์

ตัวอย่างที่1
Input:
25

Output:
5
2

ตัวอย่างที่2
Input:
2025

Output:
45
3

ตัวอย่างที่3
Input:
31625

Output:
No Numbers Matching!
'''
import math

num = int(input())

if math.sqrt(num) % 1 ==0:
  print(int(math.sqrt(num)))
else:
  print("No Numbers Matching!")
