'''
คำอธิบาย
รับค่า 2 ค่า แล้วคำนวณหาพื้นที่(Area)และเส้นรอบรูป(Circumference)
โดย สูตร area = ความกว้าง * ความยาว
circumference = 2 * (ความกว้าง * ความยาว)

รูปเเบบ Input
รับค่าตัวเลขจำนวนเต็ม 2 ค่า
คำนวณหาค่า พื้นที่ กับ ความยาวเส้นรอบรูป ตามสูตรที่ให้มา

รูปเเบบ Output
แสดงค่า พื้นที่และความยาวเส้นรอบรูป

ข้อจำกัด
รับค่าจำนวนเต็มเท่านั้น

ตัวอย่างที่1
Input:
4
5

Output:
Area = 20
Circumference = 18
'''

S1, S2 = [int(input()) for i in range(2)]

print(f"Area = {S1*S2}")
print(f"Circumference = {S1*2 + S2*2}")
