'''
คำอธิบาย
ในข้อนี้เราจะให้คุณหาค่าเฉลี่ยของจำนวนจริง 3 จำนวน

รูปเเบบ Input
ข้อมูลนำเข้ามี 3 บรรทัด
บรรทัดที่ 1 รับค่าจำนวนที่ 1
บรรทัดที่ 2 รับค่าจำนวนที่ 2
บรรทัดที่ 3 รับค่าจำนวนที่ 3

รูปเเบบ Output
ข้อมูลส่งออกมี 1 บรรทัด คือ ค่าเฉลี่ยของจำนวน 3 จำนวน

ข้อจำกัด
จำนวน 3 จำนวนนี้อาจติดทศนิยมได้


ตัวอย่างที่1
Input:
1
2
3

Output:
2

ตัวอย่างที่2
Input:
0
0
0

Output:
0
3

ตัวอย่างที่3
Input:
-1
0
1

Output:
0
'''
num = [int(input()) for i in range(3)]
print(sum(num)//3)
