'''
คำอธิบาย
ให้หาค่าเฉลี่ยของจำนวนเต็ม N ตัว เช่น ถ้ากรอก 5 ก็ต้องรับค่าอีก 5 ตัว เพื่อหาค่าเฉลี่ย

รูปเเบบ Input
บรรทัดที่ 1 รับตัวเลขจำนวนเต็ม
บรรทัดที่ 2 - n รับตัวเลขจำนวนเต็ม

รูปแบบ Output
แสดงผลเป็นรูปแบบตัวเลขทศนิยม 

ข้อจำกัด
ข้อมูลที่ Input จะมีค่าตั้งแต่ 0 - 1,000,000 
ข้อมูลที่ output จะมีค่าตั้งแต่ 0 - 1,000,000 เป็นจำนวนทศนิยม

ตัวอย่างที่ 1
ข้อมูลขาเข้า
2
4
4

ผลลัพธ์
4.0

ตัวอย่างที่ 2
ข้อมูลขาเข้า
3
1
2
3

ผลลัพธ์
2.0

ตัวอย่างที่ 3
ข้อมูลขาเข้า
4
2
3
6
7

ผลลัพธ์
4.5
'''

num = int(input())

total_in = [int(input()) for i in range(num)]

result = sum(total_in)/len(total_in)

print(result)
