'''
คำอธิบาย
อาจารย์ประจำศูนย์ ค่าย สอวน. ท่านหนึ่ง ต้องการเปรียบเทียบคะแนนสอบของนักเรียนในค่าย โดยนำมาแสดงผลเป็นกราฟแท่งตามแนวยาว ให้มีขนาดเท่ากับคะแนนที่ได้ (จำนวนนักเรียนกำหนดเป็น n คน)

รูปเเบบ Input
5
25
39
48
12
20

รูปเเบบ Output

************************* (25)
*************************************** (39)
************************************************ (48)
************ (12)
******************** (20)

ข้อจำกัด

ตัวอย่างที่1
Input:
5
25
39
48
12
20

Output:

************************* (25)
*************************************** (39)
************************************************ (48)
************ (12)
******************** (20)

ตัวอย่างที่2
Input:

3
12
25
39
Output:

************ (12)
************************* (25)
*************************************** (39)
'''
num = int(input())

value_list = [int(input()) for i in range(num)]

def graph():
  for item in value_list:
    print("*"*item, f"({item})")  if item != 0 else  print("(0)")


graph()
