'''
คำอธิบาย

เรียนรู้ผ่านโจทย์ :



โรงเรียนของเด็กชายเอ ขึ้นชื่อเรื่องความเข้มแข็งทางด้านวิชาการมาก
ทำให้เด็กในโรงเรียนสามารถคว้ารางวัลโนเบลมาได้ทุกปี
แม้จะเป็นเพียงแค่เด็กประถมเท่านั้น ส่วนการตัดเกรดของอาจารย์นั้นจะใช้รูปแบบ A - F
เช่นเดียวกับมหาวิทยาลัยชั้นนำทั่วไป โดยเราในฐานะของโปรแกรมเมอร์
ที่ถูกโรงเรียนดังกล่าวว่าจ้างให้ทำการพัฒนาโปรแกรมคำนวณเกรดให้สมบูรณ์ และ มี
เกณฑ์คะแนนรวมถึงเกรดตามข้อมูลด้านล่าง

ผู้ที่ได้คะแนนตั้งแต่ 90 คะแนนขึ้นไปจะได้เกรด A
ผู้ที่ได้คะแนนตั้งแต่ 85 - 89 จะได้เกรด B+
ผู้ที่ได้คะแนนตั้งแต่ 80 - 84 จะได้เกรด B
ผู้ที่ได้คะแนนตั้งแต่ 75 - 79 จะได้เกรด C+
ผู้ที่ได้คะแนนตั้งแต่ 70 - 74 จะได้เกรด C
ผู้ที่ได้คะแนนตั้งแต่ 65 - 69 จะได้เกรด D+
ผู้ที่ได้คะแนนตั้งแต่ 60 - 64 จะได้เกรด D
ผู้ที่ได้คะแนนต่ำกว่า 60 ลงไปจะได้เกรด F
โดยโปรแกรมดังกล่าวจะให้ผู้ใช้งาน"กรอก" ข้อมูลตัวเลขคะแนนเข้ามา และ
โปรแกรมจะทำการแสดงผลข้อมูลเกรดออกไปดังตัวอย่าง

'''

P = int(input())

if P >=90 and P <=100:
  print("A")
elif P >=85 and P<=89:
  print("B+")
elif P >=80 and P<=84:
  print("B")
elif P >=75 and P<=79:
  print("C+")
elif P >=70 and P<=74:
  print("C")
elif P >=65 and P<=69:
  print("D+")
elif P >=60 and P<=64:
  print("D")
else:
  print("F")
