'''
คำอธิบาย

เรียนรู้ผ่านโจทย์ :

จำได้หรือไม่เมื่อโปรแกรมของบทเรียนตอนที่แล้ว ? แต่เมื่อคุณครูวิชาวิทยาศาสตร์ แขนงวิชา ฟิสิกส์นิวเคลียร์
ฝ่ายมัธยมต้นใช้โปรแกรมดังกล่าว แล้วดันกรอกข้อมูลผิดเข้าไปในระบบ
จาก 100 เป็น 1000 ซึ่งโปรแกรมดังกล่าวก็ยังทำงานได้อยู่
ทั้งๆที่โรงเรียนได้บอกไว้แล้วว่าคะแนนจะอยู่ในช่วง 0 - 100 เท่านั้น ดังนั้นแล้ว

ให้เราทำการแก้ไขโปรแกรมข้อดังกล่าวให้กรอกได้แค่ 0 - 100 เท่านั้นก่อนนำไปคำนวณผลเพื่อตัดเกรด
โดยถ้าเกิดกรอกถูกต้องจะแสดงข้อมูลเช่นในข้อที่ 10 เหมือนเดิม แต่ถ้าเกิดกรอกต่ำกว่าหรือเกิน
ให้แจ้งว่าไม่สามารถกรอกได้ดังตัวอย่าง
'''


P = int(input())
if P > 100:
  print("Error : Value must be less than or equal to 100.")
elif P >=90 and P <=100:
  print("A")
elif P >=85 and P<=89:
  print("B+")
elif P >=80 and P<=84:
  print("B")
elif P >=75 and P<=79:
  print("C+")
elif P >=70 and P<=74:
  print("C")
elif P >=65 and P<=69:
  print("D+")
elif P >=60 and P<=64:
  print("D")
elif P <64 and P >=0:
  print("F")
else:
  print("Error : Value must be greater than or equal to 0.")
