'''
คำอธิบาย
สถาปนิกคนหนึ่ง ต้องการที่สร้างตึกของเขา ภายในโปรแกรมคอมพิวเตอร์ โดยทุกตึกมีความกว้าง(w) และ สูง(h) เท่ากัน ทั้งหมด และ อยู่ห่างกัน หนึ่งช่องเสมอ โดยมีจำนวน n ตึก (ใช้ '.' แทน ตัวตึก 1 ช่อง)

รูปเเบบ Input
รับค่า จำนวนตึก n
รับค่า ความกว้าง(w) ความยาว(h)

รูปเเบบ Output
ตึก.... สามารถดูตัวอย่างได้ภายใน test case ด้านล่าง

ข้อจำกัด
n>0, h>0, w>0

ตัวอย่างที่1
Input:
2
2 2

Output:
.. ..
.. ..

ตัวอย่างที่2
Input:
5
2 5

Output:
.. .. .. .. ..
.. .. .. .. ..
.. .. .. .. ..
.. .. .. .. ..
.. .. .. .. ..

ตัวอย่างที่3
Input:
2
1 1

Output:
. .

'''
num = int(input())
w, h = list(map(int, input().split(" ")))

w_build = "." * w

n_build = w_build
for i in range(num-1):
  n_build += " " + w_build
  
for i in range(h):
  print(n_build)
