'''
คำอธิบาย
การต่อสู้จะมีประสิทธิภาพ ถ้าเรามียานรบที่แข็งแกร่ง
เอาล่ะ เรามาสร้างยานที่แข็งแกร่งกันเถอะ..!!

รูปเเบบ Input
Input : เป็นตัวเลขจำนวนเต็มที่มีค่ามากกว่า 0

รูปเเบบ Output
เป็นยานของเรา

ตัวอย่างที่1
Input:
5

Output:

    /-\
   //-\\
  ///-\\\
 ////-\\\\
/////-\\\\\
   //V\\
   //V\\
'''
get = int(input())

def build(get):
  if get==1:
    print(" "*(get) +"/" +"-" + "\\")
    print("//V\\"+"\\")
    print("//V\\"+"\\")
  else:
    for i in range(1,get+1):
      print(" "*(get-i) +"/"*i +"-" + "\\"*i)
    print(" "*(get-2)+"//V\\"+"\\")
    print(" "*(get-2)+"//V\\"+"\\")
          
          
          
          
build(get)
