'''
คำอธิบาย
รับจำนวนเต็มบวก n จากนั้นสร้างภาพผีเสื้อ(คิดซะว่ามันเป็นผีเสื้อแล้วกัน)
*hint : มองเป็นกราฟคณิตศาสตร์*

รูปเเบบ Input
บรรทัดแรก รับจำนวนเต็มบวก n

รูปเเบบ Output
แสดงรูปผีเสื้อตามตัวอย่าง

ข้อจำกัด

ตัวอย่างที่1
Input:
4

Output:

*       *
**     **
***   ***
**** ****
*********
**** ****
***   ***
**     **
*       *

ตัวอย่างที่2
Input:
7

Output:

*             *
**           **
***         ***
****       ****
*****     *****
******   ******
******* *******
***************
******* *******
******   ******
*****     *****
****       ****
***         ***
**           **
*             *
'''


num = int(input())

def butterfly(num):
  for i in range(1, num+1):
    print("*"*i + " "*(((num-i)*2)+1) + "*"*i)
  print("*"*((num*2)+1))
  for i in range(num, 0, -1):
    print("*"*i + " "*(((num-i)*2)+1) + "*"*i)


butterfly(num)
