'''
คำอธิบาย
วันนี้ลุงแซมซึ่งเป็นพ่อค้า มีลูกค้ามาอย่างเหนียวแน่นทําให้เขาคิดเลขไม่ทัน จึงต้องมีเครื่องคิดเลขไว้บริการ เขาจึงขอให้เราช่วยสร้างโปรแกรมเครื่องคิดเลขให้เขาหน่อย โดยเมื่อพิมพ์ + เพื่อบวก ,- เพื่อลบ,* เพื่อคูณ, / เพื่อหาร และมีตัวรับแบบจํานวนเต็ม 2 ตัว

รูปเเบบ Input
ตามภาพข้างล่าง

รูปเเบบ Output
ตามภาพข้างล่าง

การแสดงผลต้องเป็นจํานวน

ตัวอย่างที่1
Input:
+
2
4

Output:
6

ตัวอย่างที่2
Input:
-
5
1

Output:
4
'''

Op = input()
a = int(input())
b = int(input())

if Op == "+":
  print(a+b)
elif Op == "-":
  print(a-b)
elif Op == "*":
  print(a*b)
elif Op == "/":
  print(int(a/b))
