'''
คำอธิบาย
คุณได้รับการว่าจ้างให้สร้างสร้างเครื่องคิดเลขให้กับบริษัทขนส่งเเห่งหนึ่ง โดยจะต้องมี + - * เเละ / (บวก ลบ คูณ หาร)

รูปเเบบ Input
บรรทัดที่หนึ่ง ตัวตั้ง จำนวนเต็ม
บรรทัดที่สอง เครื่องหมาย สตริง
บรรทัดที่สาม ตัวกระทำ จำนวนเต็ม

รูปเเบบ Output
คำตอบ จำนวนเต็ม

ข้อจำกัด
input = 1-10,000,000

ตัวอย่างที่1
Input:
5
*
7

Output:
35
2

ตัวอย่างที่2
Input:
2
-
3

Output:
-1
'''
a = int(input())
get_op = input()
b = int(input())

if get_op =="+":
  print(a+b)
elif get_op =="-":
  print(a-b)
elif get_op =="*":
  print(a*b)
elif get_op =="/":
  print(int(a/b))
