'''
คำอธิบาย
ให้เขียนโปรแกรมจัดการหมวดหมู่ของตัวเลขแบบกำหนดเอง โดยจะมีการตั้งชื่อให้ในแต่ละหมวกหมู่ โดยตัวเลขจะเป็นจำนวนเต็มทั้งหมด และแต่ละหมวดหมู่จะมีทับซ้อนกัน

รูปเเบบ Input
บรรทัดแรก ค่า X เป็นค่าที่ต้องการนำไปจัดหมวดหมู่
บรรทัดที่ 2 ค่า N เป็นจำนวนหมวดหมู่ที่มี
บรรทัดต่อไป เลขจำนวนเต็ม F T ค่าสำหรับบอกขอบเขตแต่ละหมวดหมู่ และตามด้วยชื่อของหมวดหมู่

รูปเเบบ Output
แสดงชื่อของหมวดหมู่ที่ได้จากตัวเลขที่รับเข้ามา

ข้อจำกัด
0<N<100
-1000 <= F <= T <= 1000
F <= X <= T

ตัวอย่างที่1
Input:
1
3
-100 -1 negative
0 0 null
1 100 positive

Output:
positive

ตัวอย่างที่2
Input:
0
3
100 1000 up
-99 99 medium
-1000 -100 down

Output:
medium

'''
Va = int(input())

Ca = int(input())

Cata = [ input() for i in range(Ca) ]


def Category():
  for i in Cata:
    s = i.split(" ")
    a, b = [int(s[0]), int(s[1])]
    if Va in range(a, b+1):
      print(s[2])
      
if __name__ == "__main__":
  Category()
