'''
คำอธิบาย
ให้ ทำการเขียนโปรแกรม รับค่าเป็นจำนวนจริง มาเก็บไว้ที่ตัวแปร t และ ให้หาค่า dy/dx จากสมการ
x = (t^2)+(2*t) , y = (4*(t^3)) -(6*t)

รูปเเบบ Input
input เป็น จำนวนจริง ซึ่งก็คือค่า ที่นำมาเก็บไว้ในตัวแปร t

รูปเเบบ Output
แสดงเป็นทศนิยม 2 ตำแหน่ง ถ้าค่าไหนไม่สามารถหาค่าได้ให้แสดงข้อความว่า
" Error"

ตัวอย่างที่1
Input:
0

Output:
-3.00

ตัวอย่างที่2
Input:
2.5

Output:
9.86

ตัวอย่างที่3
Input:
-1

Output:
Error
'''
num = float(input())
if num <0:
  print("Error")
else:
  y = 12*(num**2) - 6
  x = 2*num + 2
  result = y/x
  print(f"{result:.2f}")
