'''
คำอธิบาย
วิธีจัดหมู่ (Combination) เป็นการเลือกสิ่งของออกมาเป็นหมู่หรือชุดโดยไม่คำนึงเเต่อย่างใดว่าจะได้สิ่งใดออกมาก่อนหรือหลัง
กำหนดให้จำนวนวิธีจัดหมู่ของสิ่งของที่เเตกต่างกัน n สิ่งนั้น โดยเลือกคราวละ r สิ่ง (โดย 10≤  r ≤ n) นั้นจะเกิดการเลือกขึ้นมา จะได้ Cn.r วิธีโดย

Cn,r =  n!/((n - r)!r!)

รูปเเบบ Input
บรรทัดแรก รับเลขจำนวนเต็ม 2 จำนวนคือ n,r

รูปเเบบ Output
แสดงผลออกมาเป็นตัวเลข

ข้อจำกัด
n > r

ตัวอย่างที่1
Input:
5 4

Output:
5

ตัวอย่างที่2
Input:
10 2

Output:
45

ตัวอย่างที่3
Input:
9 9

Output:
1
'''
import math

n, r= [int(i) for i in input().split()]

result = (math.factorial(n))/(math.factorial(n - r) * math.factorial(r))

print(int(result))
