'''
คำอธิบาย
เขียนโปรแกรมที่รับข้อความภาษาอังกฤษ 1 บรรทัด จากผู้ใช้ จากนั้นให้โปรแกรมทำการนับว่ามี ตัวอักษร และ ตัวเลข อยู่ในข้อความนั้นรวมกันกี่ตัว

ตัวอักษร: หมายถึงตัวอักษรภาษาอังกฤษ A-Z หรือ a-z
ตัวเลข: หมายถึงตัวเลข 0-9
อักขระอื่นๆ: เช่น ช่องว่าง, เครื่องหมายวรรคตอน (เช่น !, ?, ., ,) ไม่ต้องนับนะจ๊ะ

รูปเเบบ Input
บรรทัดเดียว: ข้อความภาษาอังกฤษ (สามารถมีช่องว่าง, ตัวอักษร, ตัวเลข, หรืออักขระพิเศษอื่นๆ ได้)

รูปแบบ Output
บรรทัดเดียว: จำนวนเต็ม 1 จำนวน ซึ่งเป็นผลรวมของจำนวนตัวอักษรและตัวเลขที่พบในข้อความ

ข้อจำกัด
ความยาวของข้อความไม่เกิน 1,000 ตัวอักษร

ตัวอย่างที่ 1
ข้อมูลขาเข้า
Hello World! 123

ผลลัพธ์
15

ตัวอย่างที่ 2
ข้อมูลขาเข้า
Python is fun. Version 3.9

ผลลัพธ์
20

ตัวอย่างที่ 3
ข้อมูลขาเข้า
No numbers or special characters here!

ผลลัพธ์
30
'''

import string as s

letter_digit = s.ascii_letters + s.digits


def sum_letter_digit(text):
  number = 0
  for i in text:
    if i in letter_digit:
      number += 1
  return number
  
text = input()
print(sum_letter_digit(text))
