'''
คำอธิบาย
ผมต้องทำการบ้านอีกละคราวนี้ ก็ขี้เกียจคิดเลขเองเลย เขียนโค้ดซะเลย นี้คือโจทย์
ให้นักเรียน เขียนเซตของจำนวนเต็มที่ หารทั้ง 3 และ 5 ลงตัว โดยจำนวนนั้นอยู่ในช่วง
1 - N โดย N นั้นแต่ละคนจะได้มาไม่เหมือนกัน
รูปเเบบ Input

รับค่า N ซึ่งเป็นจำนวนสุดท้ายของ 1 ไปถึง N
รูปเเบบ Output

แสดงผลเซตของตัวเลยที่หาร 3 และ 5 ลงตัว
ข้อจำกัด
N >=1

ตัวอย่างที่1
Input:
100

Output:
{ 15,30,45,60,75,90 }

ตัวอย่างที่2
Input:
250

Output:
{ 15,30,45,60,75,90,105,120,135,150,165,180,195,210,225,240 }

ตัวอย่างที่3
Input:
50

Output:
{ 15,30,45 }
'''
num = int(input())

def foo(num):
  return [str(i) for i in range(1, num+1) if i%3 ==0 and i%5 ==0]

str_re = ",".join(foo(num))

print("{ " + str_re + " }")
