'''
คำอธิบาย
นายศุภวิชญ์ เป็นเพื่อนกับนายกฤศ นายศุภวิชญ์มักจะเรียกชื่อนายกฤศว่า "karit" ซึ่งถ้าเรียกให้ถูก ต้องเรียกว่า "krit" พอนายศุภวิชญ์เรียกชื่อผิดบ่อยๆ นายกฤศจึงโมโห แล้วตั้งใจจะขโมยเงิน โดยในตอนแรกนายศุภวิชญ์มีเงินอยู่ x บาท เมื่อนายศุภวิชญ์เรียกชื่อผิด n ครั้ง นายกฤศจะเริ่มขโมยเงินนายศุภวิชญ์ โดยการขโมยครั้งที่ m จะขโมยไป m บาท ถ้าเงินที่ขโมยทั้งหมดเกิน 1000 บาทหรือขโมยจนศุภวิชญ์ไม่เหลือเงิน นายศุภวิชญ์จะรู้ตัวแล้วแจ้งจับนายกฤศ ให้แสดงผลเป็น "Krit was arrested" แต่ถ้าไม่ให้แสดงผลลัพธ์ออกมาเป็นจำนวนเงินที่นายศุภวิชญ์เหลืออยู่

รูปเเบบ Input
บรรทัดที่ 1 รับค่า x แทนจำนวนเงินที่นายศุภวิชญ์มีอยู่ในตอนแรก
บรรทัดที่ 2 รับค่า n แทนจำนวนครั้งที่นายกฤศให้อภัย(ไม่ขโมยเงิน)
บรรทัดที่ 3 รับค่า g แทนจำนวนครั้งที่เรียกชื่อผิดทั้งหมด

รูปเเบบ Output
จำนวนเงินที่นายศุภวิชญ์เหลืออยู่ หรือไม่ก็ "Krit was arrested"

ข้อจำกัด
100 <= x <= 10000
0 <= n <= 10
0 <= g <= 40
x, n, g เป็นจำนวนเต็ม

ตัวอย่างที่1
Input:
100
0
40

Output:
Krit was arrested

ตัวอย่างที่2
Input:
1000
10
10

Output:
1000

ตัวอย่างที่3
Input:
10000
0
24

Output:
9700
'''
money = int(input())
forgive_time = int(input())
wrong_call  = int(input())

def result(x, n, g):
  if n >= g:
    return x
  else:
    dif = g - n
    steal = sum(range(1, dif+1))
    if steal > x:
      return "Krit was arrested"
    else:
      return x - steal


print(result(money, forgive_time, wrong_call))
