'''
คำอธิบาย
แป้งคือเด็กพิเศษ(พิเศษมาก) เขามีสมองที่ไม่เหมือนเด็กปกติ สมองของเขาจะมอง นับหรือเข้าใจจํานวนหรือเลขทุกอย่างเป็นเลขฐานสอง เขาไม่สามารถสื่อสารกับคนปกติที่ใช้เลขฐานสิบในการสื่อสารได้ เขามักมีปัญหากับแม่ค้าเวลาไปซื้อของเสมอ เขาจึงต้องการคนที่ช่วยเปลี่ยนเลขฐานสองที่เขาเข้าใจ ให้เป็นเลขฐานสิบที่คนทั่วไปรู้เรื่อง
ให้เรารับบทเป็นผู้หวังดีสร้างโปรแกรมแปลงจากเลขฐานสองเป็นเลขฐานสิบ

รูปเเบบ Input
รับอินพุตที่เป็นเลขฐานสอง 1 จํานวน

รูปเเบบ Output
แสดงผลเลขจํานวนนั้นที่ถูกแปลงเป็นเลขฐานสิบแล้ว

ข้อจำกัด
เลขฐานสองจะมีเพียง เลข0และ1 เท่านั้น!

ตัวอย่างที่1
Input:
101

Output:
5
2

ตัวอย่างที่2
Input:
1111

Output:
15
3

ตัวอย่างที่3
Input:
11

Output:
3
'''
get = input()

num = len(get)

result = 0

for idx,i in enumerate(get[::-1]):
  if i == "0":
    result +=0
  elif i =="1":
    result += 2**idx
    
print(result)
