'''
คำอธิบาย
ความเดิมจากตอนที่แล้ว นายเซฟได้ส่งจดหมายรักไปหาสาวข้างบ้าน สาวข้างบ้านเกิดงงว่าใครส่งตัวเลขมาให้ เขาจึงได้ถือจดหมายมาให้นักสืบ สืบว่านายเซฟส่งอะไรมาให้ เขาจึงตอบว่านายเซฟมาสารภาพรักคุณ
สาวข้างบ้านนั้นรู้สึกกระวนกระวายมาก เพราะไม่เคยมีหนุ่มคนไหนมาจีบเลย เธอจึงปรึกษาหลายต่อหลายคน และเขียนจดหมายปฏิเสธว่าจะเทนายเซฟ ทีนี้มาถึงตาของนายเซฟแล้ว มาแปลจดหมายที่สาวข้างบ้านได้ส่งมา ซึ่งนายเซฟไม่ทราบว่าตนโดนเท //น่าเศร้านะครับโดนเทนี่
การแปลงตัวอักษรภาษาอังกฤษเป็นตัวเลขสามารถแปลได้ดังนี้
A=1 B=2 C=3 D=4 E=5 F=6 G=7 H=8 I=9 J=10 K=11 L=12 M=13 N=14 O=15 P=16 Q=17 R=18 S=19 T=20 U=21 V=22 W=23 X=24 Y=25 Z=26

รูปเเบบ Input
code ตัวเลข ที่สาวข้างบ้านส่งกลับมาให้นายเซฟ

รูปเเบบ Output
ประโยคภาษาอังกฤษ ที่นายเซฟแปลได้

ข้อจำกัด
output จะไม่มีการเว้นวรรค เป็นตัวพิมพ์เล็กทั้งหมด และไม่มีจุด
code ตัวเลขจะเว้นวรรค ตัวอย่าง 12 15 22 5 ไม่ใช่ 1215225

ตัวอย่างที่1
Input:
7 15 15 4 13 15 18 14 9 14 7

Output:
goodmorning

ตัวอย่างที่2
Input:
13 25 14 1 13 5 9 19

Output:
mynameis

ตัวอย่างที่3
Input:
9 12 15 22 5 25 15 21

Output:
iloveyou
'''
trans_code =  {1:"A", 2:"B", 3:"C", 4:"D", 5:"E",6:"F",7:"G", 8:"H", 9:"I", 10:"J", 11:"K", 12:"L", 13:"M",
              14:"N", 15:"O", 16:"P", 17:"Q", 18:"R", 19:"S", 20:"T", 21:"U", 22:"V", 23:"W", 24:"X",25:"Y",26:"Z"}

code = input().split(" ")
code = [int(i) for i in code]

result = ""
for i in code:
  if i in trans_code:
    result += trans_code[i]
    
print(result.lower())
