'''
คำอธิบาย
เมื่อพระในพิธีอะไรสักอย่างของคุณกำลังเทศน์ ธรรมะน้ำเย็น พระท่านจะสั่งให้คุณกินน้ำจนหมดขวด ขวดละ 1500 cm^3 ทุกๆ 12 นาที ซึ่งแต่ละคนก็จะมีลิมิตไม่เหมือนกัน จงหาจำนวนขวดน้ำของแต่ละคนที่ดื่มได้

รูปเเบบ Input
บรรทัดที่ 1 รับ ระยะเวลาที่พระเทศน์ ธรรมะน้ำเย็น
บรรทัดที่ 2 รับ จำนวนผู้เข้าฟังเทศน์ ธรรมะน้ำเย็น
บรรทัดที่ 3 ถึง n รับ ลิมิตของแต่ละคนที่ดื่มน้ำได้(cm^3)

รูปเเบบ Output
แสดงสถานะของผู้เข้าฟังเทศน์ ธรรมะน้ำเย็น
โดยถ้าหากยังไม่เกิน Limit ให้แสดง "OK" ตามด้วยกินไปกี่ขวด
แต่ถ้าเกิน Limit ไปแล้วให้แสดง "NOT OK" ตามด้วยกินไปกี่ขวด

ข้อจำกัด
เวลาเป็นหน่วย นาที

ตัวอย่างที่1
Input:
12
2
1500
500

Output:
OK 1
NOT OK 0

ตัวอย่างที่2
Input:
25
3
5529
1899
1478

Output:
OK 2
NOT OK 1
NOT OK 0

ตัวอย่างที่3
Input:
10
0
100
1000

Output:
OK 0
OK 0
OK 0
'''
time = int(input())
people = int(input())
volumn = [int(input()) for i in range(people)]

time_use = time // 12

result = []

for i in volumn:
  if i >= 1500 * time_use:
    k = 1500 * time_use // 1500
    result.append(f"OK {k}")
  else:
    use = i // 1500
    result.append(f"NOT OK {use}")
    
[print(i) for i in result]    
