'''
คำอธิบาย
เขียนโปรแกรมแสดงตัวเลขตั้งแต่ n1 ถึง n2

รูปเเบบ Input
บรรทัดที่ 1 รับตัวเลข n1
บรรทัดที่ 2 รับตัวเลข n2

รูปแบบ Output
แสดงตัวเลขตั้งแต่ตัวที่ n1 จนถึงตัวเลขตัวที่ n2

ตัวอย่างที่ 1
ข้อมูลขาเข้า
5
25

ผลลัพธ์
5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25

ตัวอย่างที่ 2
ข้อมูลขาเข้า
1
20

ผลลัพธ์
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20

ตัวอย่างที่ 3
ข้อมูลขาเข้า
8
105

ผลลัพธ์
8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32
33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56
57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80
81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103
104 105
'''
start, end = [int(input()) for i in range(2)]

result = [i for i in range(start, end+1)]

result = list(map(lambda x: str(x), result))

result = " ".join(result)
print(result)
