'''
คำอธิบาย
พหุนามดีกรีสาม เมื่อแยกตัวประกอบแล้ว จะอยู่ในรูปของ (ax+b)(cx+d)(ex+f)=0 เมื่อกระจายพหุนามแล้ว จะอยู่ในรูปของ Ax^3+Bx^2+Cx+D=0
จงเขียนโปรแกรมที่รับค่าของ a,b,c,d,e,f แล้วแสดงผลออกมาเป็นค่าของ A,B,C,D

รูปเเบบ Input
มีบรรทัดเดียว รับค่าของจำนวนเต็ม a,b,c,d,e,f คั่นด้วยช่องว่าง 1 ช่อง แทนจำนวนใน (ax+b)(cx+d)(ex+f)=0

รูปเเบบ Output
มีบรรทัดเดียว แสดงผลเป็นจำนวนเต็ม A,B,C,D คั่นด้วยช่องว่าง 1 ช่อง

ข้อจำกัด
a,c,e เป็นจำนวนเต็ม โดยที่ 1<=a,c,e<=1000
b,d,f เป็นจำนวนเต็ม โดยที่ -1000<=b,d,f<=1000 และ b,d,f ไม่เท่ากับ 0

ตัวอย่างที่1
Input:
1 -1 2 5 3 -2

Output:
6 5 -21 10

ตัวอย่างที่2
Input:
2 4 8 -4 2 -6

Output:
32 -48 -176 96

ตัวอย่างที่3
Input:
3 -4 2 -5 7 -11

Output:
42 -227 393 -220
'''
num = input().split(" ")
a, b, c, d, e, f = list(map(int, num))
A = a*c*e
B = a*c*f + a*d*e + b*c*e
C = a*d*f + b*c*f + b*d*e 
D = b*d*f

print(A, B, C, D)
