'''
คำอธิบาย
แบ่งเคิ่ง แบ่งเคิ่ง แบ่งเคิ่ง วัดเคิ่งหนึ่ง วัดเคิ่งหนึ่ง กรรมการเคิ่งหนึ่ง วัดเคิ่งหนึ่ง กรรมการเคิ่งหนึ่ง เก็บแล้วแล้วซื้อเหล้าเคิ่งหนึ่ง เคิ่งหนึ่ง กำนันเคิ่งหนึ่ง ผู้ใหญ่บ้านเคิ่งหนึ่ง ผู้ช่วยเคิ่งหนึ่ง เข้าวัด 500 แล้วเงินจริงมันกี่บาทละเนี่ยจงเขียนโปรแกรมแสดงจำนวนเงินที่แท้จริง

รูปเเบบ Input
บรรทัดที่ 1 รับตัวเลขจำนวนเต็มของจำนวนเงินที่เข้าวัด
บรรทัดที่ 2 รับตัวเลขจำนวนเต็มของจำนวนผู้ที่ได้รับเงินรวมวัดด้วย

รูปเเบบ Output
แสดงผลเป็นรูปแบบตัวเลขจำนวนเต็มของจำนวนเงินที่แท้จริงในบรรทัดที่ 1 

ข้อจำกัด
ข้อมูลที่ Input จะมีค่าตั้งแต่ 0 - 1,000,000 หรือ หากมีเศษ ให้ทำการปัดขึ้น

ตัวอย่างที่1
Input:
500
6

Output:
32000

ตัวอย่างที่2
Input:
1000
8

Output:
256000
3

ตัวอย่างที่3
Input:
200
5

Output:
6400
'''
temple , people = [int(input()) for i in range(2)]

total = (2**people)*temple

print(total)
