'''
คำอธิบาย
ภารกิจล่าอสูรในรถไฟนิรันดร์ได้เริ่มขึ้นแล้ว หน่วยพิฆาตอสูรได้ส่งนักล่าอสูรที่เป็นถึงเสาหลักเพลิงขึ้นไปบนรถไฟและพร้อมจะจัดการเหล่าอสูรกินคนบนรถไฟนิรันดร์ คุณเป็นเพียงทหารฝึกหัดได้แค่ทำการสังเกตการณ์จากข้างนอกรถไฟ เมื่อกลิ่นของอสูรปรากฏตัวขึ้นนักล่าอสูรสามารถพุ่งไปหาอสูรและจัดการได้ในทันที ด้วยความสงสัยคุณจึงคิดอยากคำนวณความเร็วของนักล่าอสูร โดยกำหนดให้คุณสังเกตการณ์ข้างนอกรถไฟและกำลังวิ่งขนานกับรถไฟ 
โจทย์ : ให้คำนวณ ความเร็วสัมพัทธ์ของนักล่าอสูรโดยมองจากมุมมองของเรา

- กำหนดให้ -
1.รถไฟมีทั้งหมด 5 ตู้ เรียงกันเป็น 1 2 3 4 5 (ซ้ายไปขวา)
2.เราที่เป็นคนสังเกตการณ์เคลื่อนที่ขนานไปกับรถไฟด้วยความเร็วคงที่ 20 เมตรต่อวินาที
3.ทิศทางที่นักล่าอสูรพุ่งไปขึ้นอยู่กับ Input บรรทัดแรก
ตัวอย่างเช่น ถ้านักล่าอสูรพุ่งจากตู้ที่ 1 ไป 4 จะถือว่าพุ่งไปทางขวา แต่ถ้าพุ่งจากตู้ที่ 4 ไป 1 จะไปทางซ้าย
คำใบ้ 1 : ความเร็วของนักล่าอสูร หาได้จากสูตร v = s / t
โดยที่ v คือความเร็ว s คือระยะทาง และ t คือเวลา
คำใบ้ 2 : ความเร็วสัมพัทธ์ของนักล่าอสูรโดยมองจากมุมมองของเรา ขึ้นอยู่กับ ทิศทางของเราและทิศทางที่นักล่าอสูรพุ่งไป ถ้าหากไปในทิศทางเดียวกัน เราจะเห็นความเร็วของนักล่าอสูรช้าลง ให้เอาความเร็วของนักล่าอสูรมาลบกับความเร็วของเรา แต่ถ้าหากไปในทิศตรงกันข้ามกัน เราจะเห็นความเร็วของนักล่าอสูรเพิ่มขึ้น ให้เอาความเร็วของนักล่าอสูรมารวมกับความเร็วของเรา

รูปเเบบ Input
บรรทัดแรก : รับค่าตัวเลขจำนวนเต็ม 2 ตัว แทน ตู้รถไฟที่นักล่าอสูรอยู่ กับ ตู้ที่อสูรอยู่ (เว้นวรรค 1 ช่อง)
บรรทัดที่สาม : รับค่าตัวเลขจำนวนจริง 2 ตัว แทน ระยะห่างระหว่างรถไฟ 1 ตู้ (หน่วย : เมตร) กับ
ระยะเวลาที่นักล่าอสูรเคลื่อนที่ผ่าน 1 ตู้  (หน่วย : วินาที) (เว้นวรรค 1 ช่อง)
บรรทัดที่สาม : รับทิศทางที่เรากำลังวิ่งไป (Left หรือ Right เท่านั้น)

รูปเเบบ Output
บรรทัดแรก : ความเร็วสัมพัทธ์ของนักล่าอสูรโดยมองจากมุมมองของเรา (หน่วย : เมตรต่อวินาที)
ถ้าหากเป็นทศนิยมให้ตอบเป็นทศนิยม 2 ตำแหน่ง

ข้อจำกัด
ระยะห่างระหว่างรถไฟ 1 ตู้ มีค่ามากกว่า 0 เมตร
ระยะเวลาที่นักล่าอสูรเคลื่อนที่ผ่าน 1 ตู้ มีค่ามากกว่า 0 วินาที
และความเร็วของนักล่าอสูร ถ้าหากเป็นทศนิยมให้ปัดขึ้นเป็น ทศนิยม 2 ตำแหน่ง
สุดท้ายคือ ความเร็วของนักล่าอสูร จะมากกว่าความเร็วของผู้สังเกตการณ์เสมอ

ตัวอย่างที่1
Input:
1 4
20 1
Left

Output:
40

ตัวอย่างที่2
Input:
5 2
50 0.7
Left

Output:
51.43

ตัวอย่างที่3
Input:
4 3
27 1.2
Right

Output:
42.50
'''
f_c, l_c = [int(i) for i in input().split()]
s, v = [float(i) for i in input().split()]
direct_ob = input()

direct_hu = ["Right" if f_c < l_c else "Left"][0]
v_ob = 20
v_hun = s/v

result = [(v_hun - v_ob) if direct_ob == direct_hu else (v_hun + v_ob)][0]
[print(int(result)) if result%1 ==0 else print(f"{result:.2f}")]
