'''
คำอธิบาย

รายการคู่คี่
ให้เขียนโปรแกรมที่ทำหน้าที่แยกตัวเลข (จำนวนเต็ม) ของเราที่ป้อนเข้ามา

โดยพิมพ์ จำนวนคู่ไว้ด้านบน และจำนวนคี่ไว้ด้านล่าง (ต้องเรียงลำดับจากน้อยไปมากด้วย)

รูปเเบบ Input

1 บรรทัดเป็นตัวเลข n ตัว
รูปเเบบ Output

2 บรรทัด

บรรทัดบนเป็นบรรทัดของจำนวนคู่จากที่ป้อน (เรียง)
บรรทัดบนเป็นบรรทัดของจำนวนคี่จากที่ป้อน (เรียง)

ข้อจำกัด
0 ถือว่าเป็นจำนวนคู่หรือคี่?
ถ้าหากว่าลิสต์ใดลิสต์หนึ่งว่างเปล่า ไม่ต้องพิมพ์ ไม่ใช่พิมพ์บรรทัดว่าง

ตัวอย่างที่1
Input:
5 9 8 6 3 2 1 4 7 0

Output:
0 2 4 6 8
1 3 5 7 9

ตัวอย่างที่2
Input:
4 4 1 6 6 1 3 2

Output:
2 4 4 6 6
1 1 3

ตัวอย่างที่3
Input:
4 7 -8 5 -3 1 1 0 -6 11 7 44

Output:
-8 -6 0 4 44
-3 1 1 5 7 7 11
'''

num = list(map(int, input().split(" ")))

even = sorted(list(filter(lambda x: x%2 ==0, num)))
odd = sorted(list(filter(lambda x: x%2 ==1, num)))

even = (str(i) for i in even)
odd = (str(i) for i in odd)

even = " ".join(even)
odd = " ".join(odd)

if even: print(even)
if odd: print(odd)
