'''
คำอธิบาย
นายเซฟกำลังสนใจเรื่อง factorial เค้ากำลังคิดว่า การมานั่งกดคูณในเครื่องคิดเลขนั้นลำบากมากถ้ามีโปรแกรมที่นายเซฟสามารถใส่เลขที่ต้องการหาค่า factorial
ละเด้งค่ามาเลยคงจะสะดวกมาก ทุกคนมาทำโปรแกรมนี้ให้นายเซฟกันเถอะครับ ^^
————————————————————————————————
เอาง่ายๆโจทย์คือ หาค่าแฟกทอเรียล ****รับค่าเป็น string ****

รูปเเบบ Input
รับค่าเป็น string

รูปเเบบ Output
แสดงค่าของแฟคทอเรียลที่รับมา

ตัวอย่างที่1
Input:
[5]

Output:
5!:120

ตัวอย่างที่2
Input:
[8]

Output:
8!:40320

ตัวอย่างที่3
Input:
[4]

Output:
4!:24
'''

get = input()
get = get.rstrip("]")
get = get.lstrip("[")
get = int(get)

def fac(num):
  result = 1
  for i in range(num, 1, -1):
    result *= i
  return result

print(f'{get}!:{fac(get)}')
