'''
คำอธิบาย
ค่าควอร์เตอร์เป็นค่าที่แบ่งจำนวนเป็น 4 ส่วนเช่น

กำหนดค่าที่ให้เป็น 100
ควอร์เตอร์ 1 = 25
ควอร์เตอร์ 2 = 50
ควอร์เตอร์ 3 = 75
ควอร์เตอร์ 4 = 100

ดังนั้นทั้ง 4 ควอร์เตอร์ จะคิดเป็น 25,50,75,100% ของค่าที่ให้
(สร้างสรรค์โจทย์โดย LightningCK)

รูปเเบบ Input
บรรทัดแรกเป็นค่าที่กำหนดให้
บรรทัดที่สองเป็นควอร์เตอร์ที่ต้องการหา เขียนในรูปแบบ "Q1"

รูปเเบบ Output
ให้เขียนเป็นทศนิยม 2 ตำแหน่ง

ตัวอย่างที่1
Input:
100
Q1

Output:
25.00

ตัวอย่างที่2
Input:
175
Q3

Output:
131.25

ตัวอย่างที่3
Input:
14
Q2

Output:
7.00
'''
v = int(input())
position = input()

all_q = {"Q1":0.25, "Q2":0.5, "Q3":0.75, "Q4":1}

result = v* all_q[position]

print(f'{result:.2f}')
