'''
คำอธิบาย
ต้อนรับเพื่อนและแฟนที่เข้าร้านกาแฟของเขาด้วยคำที่ต่างจากลูกค้าคนอื่น

กำหนดให้
แฟนเขาชื่อ Lee เพื่อนเขาชื่อ Ro

รูปเเบบ Input
ชื่อลูกค้า

รูปเเบบ Output
1.ยินดีต้อนรับคุณ+ชื่อลูกค้า
2.สวัสดีที่รัก
3.หวัดดีเพื่อน

ตัวอย่างที่1
Input:
Lee

Output:
สวัสดีที่รัก

ตัวอย่างที่2
Input:
Ro

Output:
หวัดดีเพื่อน

ตัวอย่างที่3
Input:
Prayut

Output:
ยินดีต้อนรับคุณ Prayut
'''

name = input()

if name == "Lee":
  print("สวัสดีที่รัก")
elif name == "Ro":
  print("หวัดดีเพื่อน")
else:
  print(f"ยินดีต้อนรับคุณ {name}")
