'''
คำอธิบาย
คุณได้ลงทุนฝากเงินบัญชีออมทรัพย์ที่มีอัตราดอกเบี้ย 4% ต่อปี
คำนวณจำนวนเงินทั้งหมดที่จะได้รับหลังจาก 5 ปี โดยสมมติว่าดอกเบี้ยทบต้นทุกปี

รูปเเบบ Input
50,000

รูปเเบบ Output
60,832.65

ข้อจำกัด
เพื่อแก้ปัญหาแบบฝึกหัดนี้ ใช้สูตรสำหรับดอกเบี้ยทบต้นดังนี้:
A = P * (1 + r/n)^(n*t)
โดยที่
A คือ จำนวนเงินรวมดอกเบี้ย
P คือ จำนวนเงินต้น (เงินลงทุนเริ่มต้น)
r คือ อัตราดอกเบี้ยรายปี (เป็นทศนิยม)
n คือ จำนวนครั้งที่ดอกเบี้ยทบต้นต่อปี
t คือ จำนวนปี

ตัวอย่างที่1
Input:
30000

Output:
36499.59

ตัวอย่างที่2
Input:
50000

Output:
60832.65

ตัวอย่างที่3
Input:
80000

Output:
97332.23
'''
money = int(input())

result = money * (1 + 0.04/1)**(1*5)

print(f"{result:.2f}")
