'''
คำอธิบาย
หลังจากแอบดูเกรดของคุณแล้ว คุณรู้ว่าคุณตกวิชาฟิสิกส์ ซึ่งการแก้ของคุณครูผู้สอนของคุณยากมากโดยถ้าตอบถูก คุณจะได้ 1 คะแนน และถ้าตอบผิดจะโดนลบ 2 คะแนน โดยแต่ละครั้งเกณฑ์การผ่านและจำนวนข้อก็ไม่เท่ากันด้วย สิ่งที่คุณต้องทำคือหาว่าต้องทำให้ถูกอย่างน้อยกี่ข้อถึงจะผ่าน เพื่อรักษาเกรดของคุณไว้ 

รูปเเบบ Input
มีบรรทัดเดียว ประกอบด้วยจำนวนเต็ม 2 จำนวน คือ a และ b
โดยที่ a จำนวนข้อทั้งหมด และ b คือคะแนนที่ผ่าน 

รูปเเบบ Output
มีบรรทัดเดียว ประกอบด้วยจำนวนเต็ม 1 จำนวน คือ จำนวนข้ออย่างน้อยที่สุดที่คุณต้องทำให้ผ่าน 

ข้อจำกัด
1 ≤ a,b ≤ 100

ตัวอย่างที่1
Input:
10 6

Output:
9
2

ตัวอย่างที่2
Input:
30 20

Output:
27

ตัวอย่างที่3
Input:
100 60

Output:
87
'''
total, taget = list(map(int, input().strip(" ").split()))



def lowest():
  num_wrong = 0
  for i in range(total,-1,-1):
    point = (total - num_wrong) - num_wrong*2
    num_wrong +=1
    if point - taget == 2 :
      return total - num_wrong +1
    elif point - taget <= 1:
      return total - num_wrong +1
    
print(lowest())
