'''
คำอธิบาย
คุณรู้สึกกระหายน้ำ จึงต้องสร้างโปรแกรมที่สร้างแก้วน้ำออกมาให้คุณดื่ม

รูปเเบบ Input
บรรทัดแรก : จำนวนเต็มของความสูงของแก้วน้ำ (h)
บรรทัดที่สอง : จำนวนเต็มของระดับน้ำในแก้ว (w)

รูปเเบบ Output
บรรทัดตามความสูง : ปริ้นเป็น pattern แก้วตาม output ที่กำหนด
และฐานของแก้วต้องเป็น \---/ เท่านั้น

ข้อจำกัด
1 < h < 10
w <= h
ถ้าระดับน้ำในแก้ว (w) มีค่าเป็น 0 หรือ 1 ปริ้นแค่แก้วเปล่าๆออกมาเลย

ตัวอย่างที่1
Input:
3
1

Output:
\       /
 \     /
  \---/

ตัวอย่างที่2
Input:
3
2

Output:
\       /
 \^^^^^/
  \---/

ตัวอย่างที่3
Input:
5
4

Output:
\           /
 \^^^^^^^^^/
  \       /
   \     /
    \---/
'''
floor, water = [int(input()) for i in range(2)]

for i in range(1, floor+1):
  if i == floor:
    print(" "*(i-1) +"\\" +"-"*3 + "/")
  elif i == floor+1 - water:
    print(" "*(i-1) +"\\" + "^"+"^"*(floor*2-((i-1)*2)) + "/")
  else:
    print(" "*(i-1) +"\\" + " "+" "*(floor*2-((i-1)*2)) + "/")
