'''
คำอธิบาย
ในการเรียนวิชาคอมพิวเตอร์ ณ โรงเรียนแห่งหนึ่ง ใช้วิธีการเก็บคะแนนในรูปแบบของ

• คะแนนเก็บ 20 คะแนน

• คะแนนสอบกลางภาค 40 คะแนน

• คะแนนสอบปลายภาค 40 คะแนน

รวมทั้งสิ้น 100 คะแนน หลังจากที่จบภาคการศึกษา ฝ่ายทะเบียนวัดผลของโรงเรียนต้องการให้อาจารย์ที่สอนวิชา คอมพิวเตอร์มาคีย์คะแนนลงในระบบคอมพิวเตอร์ เพื่อจะได้ทราบถึงเกรดที่นักเรียนแต่ละคนควรจะได้ โดยใช้โปรแกรมเข้าช่วย แต่เนื่องจากว่าทางงานทะเบียนวัดผลนี้ยังไม่มีโปรแกรมใช้ (อาจเป็นเพราะเหตุเกิดเมื่อนานมาแล้ว) อาจารย์ฝ่ายทะเบียนวัดผลจึงมาขอให้คุณช่วยเขียนโปรแกรมให้หน่อย 



โจทย์ ให้นักเรียนเขียนโปรแกรมตัดเกรดเพื่อช่วยงานทะเบียนวัดผลของโรงเรียนแห่งนี้

รูปเเบบ Input
บรรทัดแรก จำนวนเต็มบวก a (0 ≤ a ≤ 20) เป็นคะแนนเก็บของนักเรียน

บรรทัดที่สอง จำนวนเต็มบวก b (0 ≤ b ≤ 40) เป็นคะแนนสอบกลางภาคของนักเรียน

บรรทัดที่สาม จำนวนเต็มบวก c (0 ≤ c ≤ 40) เป็นคะแนนสอบปลายภาคของนักเรียน

รูปแบบ Output
บรรทัดแรก เป็นอักขระใช้แทนเกรดของนักเรียน โดยที่ใช้อักขระตามเงื่อนไขดังต่อไปนี้

• A ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 80 − 100

• B+ ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 75 − 79

• B ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 70 − 74

• C+ ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 65 − 69

• C ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 60 − 64

• D+ ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 55 − 59

• D ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 50 − 54

• F ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 0 − 49

ตัวอย่างที่ 1
ข้อมูลขาเข้า

25
25
30

ผลลัพธ์

A

ตัวอย่างที่ 2
ข้อมูลขาเข้า

20
20
20

ผลลัพธ์

C

ตัวอย่างที่ 3
ข้อมูลขาเข้า

10
10
10

ผลลัพธ์



'''


total = [input() for i in range(3)]

def check_clean_input(total):
  clean_score = []
  for i in total:
    i=str(i)
    if i.isdigit():
      clean_score.append(int(i))
    else:
      i = int(i[:-1])
      clean_score.append(i)
  return clean_score

total = sum(check_clean_input(total))

if total >= 80 :
  print("A")
elif total >= 75 and total <= 79:
  print("B+")
elif total >= 70 and total <= 74:
  print("B")
elif total >= 65 and total <= 69:
  print("C+")
elif total >= 60 and total <= 64:
  print("C")
elif total >= 55 and total <= 59:
  print("D+")
elif total >= 50 and total <= 54:
  print("D")
else:
  print("F")
