'''
คำอธิบาย
มีร้านหมูกะทะเปิดใหม่ คุณเป็นชาวDevที่เสริฟหมูกะทะได้นิดหน่อย ต้องช่วยร้านในการคัดส่วนสูงเพื่อจ่ายราคาหมูกะทะที่แตกต่างกันไป สูงต่ำกว่า 65 ซม. กินฟรี สูง65-120 ซม. จ่าย 120 บาท สูง120 ซม.ขึ้นไปจ่าย 199 บาท

รูปเเบบ Input
ชื่อ
ตัวเลขของส่วนสูง

รูปเเบบ Output
ราคาที่ต้องจ่าย

ตัวอย่างที่1
Input:
SSS
165

Output:
sss: 199 

ตัวอย่างที่2
Input:
Ace
98

Output:
Ace: 120

ตัวอย่างที่3
Input:
Lab
46

Output:
Lab: Free
'''

name = input()
height = int(input())


if height < 65: print(f"{name}: Free")
elif 65 < height < 120: print(f"{name}: 120")
else: print(f"{name}: 199")
