'''
คำอธิบาย
ใกล้จะประกาศเกรดของน้องๆโรงเรียนอนุบาลไก่แจ้
แต่ยังตรวจข้อสอบไม่เสร็จเลย
ตายแล้ว ฉันทำไม่ทันแน่ๆ คุณช่วยฉันหน่อยได้ไหม

PLEASEEEEEE

รูปเเบบ Input
บรรทัดที่ 1 รับค่าเป็น Array ของเลขจำนวนเต็ม - สำหรับคำตอบของนักเรียน
บรรทัดที่ 2 รับค่าเป็น Array ของเลขจำนวนเต็ม - สำหรับคำตอบที่ถูกต้อง

ตัวอย่าง
[1,1,2,3,4]
[2,2,2,3,1]

รูปแบบ Output
แสดงคะแนนรวมทั้งหมด ที่นักเรียนได้
โดยหากถูก 1 ข้อ จะได้ 1 คะแนน
และหากตอบผิด ได้ 0 คะแนน

2
ข้อจำกัด
** กำหนดให้ Array ทั้ง 2 ตัว จะมีจำนวนข้อมูลเท่ากันเสมอ
** ข้อมูลใน Array มีค่าเป็นแค่ 1 ถึง 4 เท่านั้น
** Array จะมีจำนวนข้อมูลมากกว่า 0 เสมอ

ตัวอย่างที่ 1
ข้อมูลขาเข้า
[1,1,2,3,4]
[2,2,2,3,1]

ผลลัพธ์
2

ตัวอย่างที่ 2
ข้อมูลขาเข้า
[1,2,3]
[1,2,3]

ผลลัพธ์
3

ตัวอย่างที่ 3
ข้อมูลขาเข้า
[1,1,1,1,1,1,1,1,1,1,1]
[3,3,3,3,3,3,3,3,3,3,3]

ผลลัพธ์
0
'''

exam, correct = [input() for i in range(2)]

exam = exam.strip("[").strip("]").split(",")
correct = correct.strip("[").strip("]").split(",")

def check(exam, correct):
  point = 0
  for i, j in zip(exam, correct):
    if i == j:
      point += 1
  return point


print(check(exam, correct))
