'''
คำอธิบาย
จงหาจำนวนหลักของ A ยกกำลัง B แล้วนำไป Modulo ด้วย 1000000007

รูปเเบบ Input
บรรทัดที่ 1 : จำนวนเต็ม A
บรรทัดที่ 2 : จำนวนเต็ม B

รูปเเบบ Output
จำนวนหลักของ A ยกกำลัง B แล้วนำไป Modulo ด้วย 1000000007

ข้อจำกัด
1 <= A ,B <= 18,446,744,073,709,551,615

ตัวอย่างที่1
Input:
2
100

Output:
31

ตัวอย่างที่2
Input:
127
12

Output:
26

ตัวอย่างที่3
Input:
32
64128256

Output:
96522644
4

ตัวอย่างที่4
Input:
87
544876

Output:
1056798

ตัวอย่างที่5
Input:
654879642315
979878946551647

Output:
792150970
6

ตัวอย่างที่6
Input:
1272551081
1926073815862655512

Output:
534407533
'''

import math


a, b = [int(input()) for i in range(2)]
c = (int(math.log10(a) *b) +1) % 1000000007  
print(c)
