'''
คำอธิบาย
เด็กชายขจรศักดิ์อยากจะรู้ว่าเดือน m ในปี พ.ศ. y มีทั้งหมดกี่วัน
จึงอยากให้คุณเขียนโปรแกรมช่วยเด็กชายขจรศักดิ์
โดยที่เดือนกุมภาพันธ์จะมี 29 วัน เมื่อ (ปี ค.ศ. นั้นหารด้วย 4 ลงตัวและหารด้วย 100 ไม่ลงตัว) หรือ (ปีค.ศ. นั้นหารด้วย 400 ลงตัว)

รูปเเบบ Input
รับจำนวนเต็ม 2 จำนวนอยู่ในบรรทัดเดียวกันคั่งด้วยเว้นวรรค
โดยเลขเดือนมีค่าระหว่าง 1 ถึง 12

รูปเเบบ Output
จำนวนวันของเดือนและปีที่ input

ตัวอย่างที่1
Input:
3 2542

Output:
31

ตัวอย่างที่2
Input:
11 2500

Output:
30

ตัวอย่างที่3
Input:
2 2564

Output:
28
'''
month, year = [int(i) for i in (input().split(" "))]
year = year - 543
dict_m = {1:31, 2:28, 3:31, 4:30, 5:31, 6:30, 7:31, 8:31, 9:30, 10:31, 11:30, 12:31}


if year % 4 ==  0 and year % 100 != 0:
  if month == 2:
    print(dict_m[month]+1)
  else:
    print(dict_m[month])
else:
  print(dict_m[month])
    
