'''
คำอธิบาย

อยู่ดีๆคุณก็อยากสร้างตึกขึ้นมา แต่ทว่าคุณนั้นไม่รู้วิธีใช้เครื่องมือ,อุปกรณ์,โปรแกรม หรือ แอพที่ใช้ในการออกแบบเลย สิ่งเดียวที่คุณทำเป็นคือpython จงใช้มันสร้างตึกที่มีฐานที่แข็งแรงออกมา

รูปเเบบ Input
บรรทัดที่ 1 list แทนในrangeขนาดตัวตึก
บรรทัดที่ 2 list แทนในrangeขนาดฐาน

รูปเเบบ Output
แสดงตึกพร้อมทั้งฐานออกมา

ข้อจำกัด
ระวังเรื่องกำหนดขนาดของrangeนะครับ เพราะต้องทำให้ตรงกับ output

ตัวอย่างที่1
Input:
1 2 3 4 5 6 7
1 2 3 4 5

Output:

       * 
      * * 
      * * 
     * * * 
     * * * 
     * * * 
    * * * * 
    * * * * 
    * * * * 
    * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
***************
***************
***************
***************
***************

ตัวอย่างที่2
Input:
1 2 3 4 5 6 7
1 2 3 4

Output:


       * 
      * * 
      * * 
     * * * 
     * * * 
     * * * 
    * * * * 
    * * * * 
    * * * * 
    * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
***************
***************
***************
***************

ตัวอย่างที่3
Input:
1 2 3 4 5 6 7
1 2 3

Output:

       * 
      * * 
      * * 
     * * * 
     * * * 
     * * * 
    * * * * 
    * * * * 
    * * * * 
    * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
   * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
  * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
 * * * * * * * 
***************
***************
***************
'''
body = int(max(input().split(" ")))
base = int(max(input().split(" ")))


def body_b(body, sequen):
  for i in range(1, body+1):
    print(" "*sequen, end="")
    for j in range(body*2-1):
      if j%2 ==0:
        print("*", end="")
      else:
        print(" ", end="")
    print("")

def base_b():
  for i in range(base):
    print("*"*15)

for s in range(body):
  space = body - s 
  body_b(s+1, space)
base_b()
