'''
คำอธิบาย
ต้าว พึ่งเรียนฟิสิกส์เรื่องการตกอย่างอิสระมาเขาจึงอยากลองโยนบอลในแนวดิ่งดู
โดยที่อยากจะโยนบอลให้สูงเท่ากับที่ตัวเองคิดแต่ขี้เกียจคำนวณความเร็วต้นเองจึงให้เพื่อนที่เก่งคอมพิวเตอร์เขียนโปรแกรมคำนวณความเร็วต้นให้ให้โดยใช้สูตร
v^2 = u^2 + 2gs

**เผื่อคนที่ลืมแล้วนะจ้ะ**
v = ความเร็วปลาย (m/s)
u = ความเร็วต้น (m/s)
g = ความเร่งโน้มถ้วง (m/s^2) **กำหนด 10 m/s^2 **
s = ความสูงที่โยนขึ้นไป

รูปเเบบ Input
ค่า s (หน่วย เมตร)

รูปเเบบ Output
ความเร็วต้น (เมตรต่อวินาที) **ตอบทศนิยมสองต่ำแหน่ง**

ตัวอย่างที่1
Input:
20

Output:
20.00 m/s
'''

import math
get = int(input())

u_pow2 =   2*10*get
u = math.sqrt(u_pow2)

print(f"{u:.2f} m/s")
