'''
คำอธิบาย
มีชายคนหนึ่งเขาไม่เคยเห็นเลนส์มาก่อน แต่เขาจำวิชาฟิสิกส์ตอน ม.2 ได้ว่า ถ้าหากนำวัตถุหากจากเลนส์และวางวัตถุไว้หน้าเลนส์ เป็นระยะ S
ภาพที่เกิดขึ้นเป็นระยะ Y หากจากตัวเลนส์ ความยาวโฟกัสของเลนส์จะหาได้จาก 1/f = 1/S + 1/Y

ซึ่ง f > 0 จะเป็นเลนส์นูน
f < 0 จะเป็นเลนส์เว้า

รูปเเบบ Input
ค่าของ S, Y

รูปเเบบ Output
บรรทัดแรก แสดงค่าของ f ที่เป็นทศนิยม 2 ตำแหน่ง หน่วย cm
บรรทัดที่สอง บอกว่าเป็น "เลนส์นูน" หรือ "เลนส์เว้า"

ข้อจำกัด
โดยที่ S เป็นจำนวนนับ และ Y เป็นจำนวนเต็มที่ไม่เท่ากับ 0 หน่วย cm

** S+Y ต้องไม่เท่ากับ 0

ตัวอย่างที่1
Input:
15 30

Output:
10.00 cm
เลนส์นูน

ตัวอย่างที่2
Input:
10 20

Output:
6.67 cm
เลนส์นูน
'''

s, y = input().split()

f = 1/((1/int(s))+(1/int(y)))

if f > 0:
  print(f"{f:.2f} cm")
  print("เลนส์นูน")
else:
  print(f"{f:.2f} cm")
  print("เลนส์เว้า")
