'''
คำอธิบาย
ผมมีวงกลมสมมาตรแต่สงสัยว่าถ้ายัดสี่เหลี่ยมจัตุรัสเข้าไปในวงกลมสมมาตร อยากรู้ว่าความยาวรอบรูปและพื้นที่ของสี่เหลี่ยมจัตุรัสรูปที่ใหญ่ที่สุดที่สามาตรยัดในวงกลมสมมาตรคือเท่าไรกัน !?

รูปเเบบ Input
เส้นผ่าศูนย์กลางของวงกลมสมมาตร

รูปเเบบ Output
ความยาวรอบรูป และพื้นที่ตามลำดับ แสดงเป็นทศนิยม 2 ตำแหน่ง

ตัวอย่างที่1
Input:
25.45

Output:
71.98
323.85

ตัวอย่างที่2
Input:
75

Output:
212.13
2812.50

ตัวอย่างที่3
Input:
19

Output:
53.74
180.50
'''
diameter = float(input())
side = ((diameter**2)/2)**(1/2) 
print(f'{side*4:.2f}') 
print(f'{side*side:.2f}')
