'''
คำอธิบาย
กำหนดให้ N (1<=N<=12) แทนเดือน เช่น 1 แทนมกราคม 2 แทนกุมภาพันธ์ ไปเรื่อย ๆ จนถึง 12 แทน ธันวาคม
ให้วันที่ i เป็นวันที่ดี (Lucky Day) ก็ต่อเมื่อ เลขของวันที่ i บวกกับเลขของเมื่อวาน แล้วหารด้วย N ลงตัว
จงหาว่าเดือนที่ N จะมีวันที่ดีกี่วัน
(กำหนดให้กุมภาพันธ์มี 28 วัน)
(ถ้าหากวันนั้นเป็นวันที่ 1 ให้เมื่อวานเป็นวันสุดท้ายของเดือนที่แล้ว เช่น วันที่ 1 เมษายน ทำให้เมื่อวานคือวันที่ 31 มีนาคม)

รูปเเบบ Input
มีบรรทัดเดียว รับจำนวนเต็ม N (1<=N<=12) แทนหมายเลขเดือน

รูปเเบบ Output
มีบรรทัดเดียว แสดงผลเป็นจำนวนเต็ม คือจำนวนวันที่เป็นวันที่ดีของเดือน ๆ นั้น

ตัวอย่างที่1
Input:
3

Output:
10

ตัวอย่างที่2
Input:
1

Output:
31

ตัวอย่างที่3
Input:
4

Output:
1
'''
m = int(input())

dict_m = {1:31, 2:28, 3:31, 4:30,
               5:31, 6:30, 7:31, 8:31,
               9:30, 10:31, 11:30, 12:31}

luck_day_list =[]
def luck_day(m):
  num_d = dict_m[m]
  for i in range(1, num_d+1):
    if i ==1:
      luck_day_one = (i + dict_m[m-1]) % m
      if luck_day_one ==0:
        luck_day_list.append(i)
    else:
        luck_day_one = (i + (i - 1)) % m
        if luck_day_one ==0:
          luck_day_list.append(i)
luck_day(m)
print(len(luck_day_list))
