'''
คำอธิบาย
โปรแกรมจะรับค่าจำนวนเงินที่ต้องการแลกมาและคำนวนออกมาว่าจะได้ ธนบัตรและเหรียญใดบ้าง
จำนวนธนาบัตร ประเภทใดบ้างได้จำนวนกี่ฉบับ และจำนวนเหรียญชิดใดบ้าง ชนิดละกี่เหรียญ และแสดงผลรวมเงินที่ต้องการแลกทั้งหมด
เครื่องนี้เป็นเครื่องรุ่นเก่ายังไม่สามารถแลกเหรียญสตางค์ได้

รูปเเบบ Input
รับค่าจำนวนเงินบาท เป็นจำนวนเต็ม (int)

รูปเเบบ Output
จำนวนธนาบัตร ประเภทใดบ้างได้จำนวนกี่ฉบับ
จำนวนเหรียญชิดใดบ้าง ชนิดละกี่เหรียญ
และแสดงผลรวมเงินที่ต้องการแลกทั้งหมด

ธนาบัตร มี 5 ชนิด
1.ชนิดฉบับละ 1,000 บาท
2.ชนิดฉบับละ 500 บาท
3.ชนิดฉบับละ 100 บาท
4.ชนิดฉบับละ 50 บาท
2.ชนิดฉบับละ 20 บาท

เหรียญ มี 3 ชนิด
1.ชนิดเหรียญละ10 บาท
5.ชนิดเหรียญละ 5 บาท
3.ชนิดเหรียญละ 1 บาท

ตัวอย่างที่1
Input:
752

Output:
ธนบัตร 500฿ : 1 ฉบับ
ธนบัตร 100฿ : 2 ฉบับ
ธนบัตร 50฿ : 1 ฉบับ
เหรียญ 1฿ : 2 เหรียญ
จำนวนเงินที่แลกทั้งหมด 752 บาท

ตัวอย่างที่2
Input:
84502

Output:
ธนบัตร 1,000฿ : 84 ฉบับ
ธนบัตร 500฿ : 1 ฉบับ
เหรียญ 1฿ : 2 เหรียญ
จำนวนเงินที่แลกทั้งหมด 84,502 บาท
'''
money = int(input())
total = money
mon_1000 = None
mon_500 = None
mon_100 = None
mon_50 = None
mon_20 = None
mon_10 = None
mon_5 = None
mon_1 = None

while money !=0:
  if money >= 1000:
    mon_1000 = money//1000
    money = money%1000
  elif money >= 500 and money <1000:
    mon_500 = money//500
    money = money%500
  elif money >= 100 and money <500:
    mon_100 = money//100
    money = money%100
  elif money >= 50 and money <100:
    mon_50 = money//50
    money = money%50
  elif money >= 20 and money<50:
    mon_20 = money//20
    money = money%20
  elif money >= 10 and money <20:
    mon_10 = money//10
    money = money%10
  elif money >= 5 and money <10:
    mon_5 = money//5
    money = money%5
  elif money >= 1:
    mon_1 = money//1
    money = money%1
    
if mon_1000 != None:
  print(f"ธนบัตร 1,000฿ : {mon_1000} ฉบับ")
if mon_500 != None:
  print(f"ธนบัตร 500฿ : {mon_500} ฉบับ")
if mon_100 != None:
  print(f"ธนบัตร 100฿ : {mon_100} ฉบับ")
if mon_50 != None:
  print(f"ธนบัตร 50฿ : {mon_50} ฉบับ")
if mon_20 != None:
  print(f"ธนบัตร 20฿ : {mon_20} ฉบับ")
if mon_10 != None:
  print(f"เหรียญ 10฿ : {mon_10} เหรียญ")
if mon_5 != None:
  print(f"เหรียญ 5฿ : {mon_5} เหรียญ")
if mon_1 != None:
  print(f"เหรียญ 1฿ : {mon_1} เหรียญ")
print(f"จำนวนเงินที่แลกทั้งหมด {total:,} บาท")
