'''
คำอธิบาย
ผมมีชื่อว่าเเทนเป็นเด็นมัธยมปีที่ 5 ซึ่งกำลังเจอกับวิชาคณิตศาสตร์ในเรื่องลำดับและอนุกรมตอนนี้นั้นคุณครูคณิตศาสตร์สติเฟื่องกำลังสอนวิชานี้ให้ผมและเพื่อนและแก่ก็เขียนลำดับๆหนึ่งขึ้นมาและให้พวกเราหาว่าพจณ์ที่ n เป็นเท่าไรซึ่งผมนั้นขี้เกียจคิดเลขเลยมานั้นเขียน code เอาละนี้คือโจทย์
500,1010,1530,2060,...

รูปเเบบ Input
รับค่า n (เป็นตำแหน่งพจณ์ที่อยากรู้)

รูปเเบบ Output
แสดผลค่าของพจณ์ที่ n

ข้อจำกัด
ข้อให้สนุก

ตัวอย่างที่1
Input:
1

Output:
1010

ตัวอย่างที่2
Input:
0

Output:
500

ตัวอย่างที่3
Input:
3

Output:
2060
'''
n = int(input())

def sequence(n):
  num_pre = 500
  for i in range(n):
    num_pre += 500 + (i+1)*10
  return num_pre


print(sequence(n))
