'''
คำอธิบาย
ให้รับค่าจำนวนเต็มบวก N จากนั้นรับค่าตัวเลขจำนวนเต็ม N จำนวน แล้วให้หาค่ามากที่สุด (maximum) และค่าน้อยที่สุด (minimum) จากตัวเลขเหล่านั้น แล้วแสดงผลลัพธ์ออกมาทางหน้าจอ

รูปเเบบ Input
บรรทัดแรก รับค่า N บรรทัดที่สอง รับค่าจำนวนเต็ม N จำนวน

รูปแบบ Output
แสดงค่ามากที่สุดและค่าน้อยที่สุดในบรรทัดเดียวกัน คั่นด้วยช่องว่าง

ตัวอย่างที่ 1
ข้อมูลขาเข้า
5
3 7 2 9 4

ผลลัพธ์
9 2

ตัวอย่างที่ 2
ข้อมูลขาเข้า
3
10 5 8

ผลลัพธ์
10 5

ตัวอย่างที่ 3
ข้อมูลขาเข้า
4
1 1 1 1

ผลลัพธ์
1 1
'''

num_in = int(input())
set_num = list(map(lambda x: int(x), input().split(" ")))

print(f"{max(set_num)} {min(set_num)}")
