'''
คำอธิบาย
คำอธิบาย(ใครจะอ่านก็อ่าน)
วันนี้ พ่อของฉันได้ทำการเปิดรับสมัครคนเข้าร่วมการแข่งว่ายน้ำ (จำนวนไม่จำกัด)
พ่อบอกว่า "พ่อยังไม่รู้เลยว่ามีคนสมัครกี่คน"
อ่าว.. งั้นพ่อรู้ชื่อรึเปล่าครับ ผมถาม
พ่อได้ตอบมาว่า "ไม่รู้"

-----------------------------------------------------------------

โจทย์
เมื่อพ่อรู้ว่าฉันสามารถเขียนโปรแกรมได้เก่งมากๆ
พ่อจึงขอให้ฉันสร้างโปรแกรมที่ให้คนสมัครพิมพ์ชื่อตัวเองลงใน
(ดูด้านล่างเป็นภาพประกอบนะจ๊ะ ถึงจะไม่มีภาพก็เถอะดูตัวอักษรเอาก็ได้)

รูปเเบบ Input
input ชื่อคน(ทั้งหมด)
มี input ตัวเดียวนะจ๊ะ :)
อุ้ย ยากละสิ

รูปเเบบ Output
---ทำการ input ชื่อคนทั้งหมด---
บรรทัดแรก คือ บอกว่ามีผู้เข้าแข่งขันกี่คน

ตัวอย่างที่1
Input:
Somsak Somsee Ploy Kai Namsai

Output:
5

ตัวอย่างที่2
Input:
Somsak Somsee Ploy Kai Namsai Fahsai Ingweeh

Output:
7
'''

[print(len(input().split(" ")))]
