'''
คำอธิบาย
เขียนโปรแกรมรับจำนวนเต็มชุดหนึ่ง ซึ่งเป็นจำนวนเต็มบวกทั้งหมด และจบด้วยจำนวนเต็มลบในบรรทัดสุดท้าย จากนั้นให้แสดงผลตัวเลขชุดใหม่ที่เกิดจากการนำเอาเลขชุดเดิมมามารวมกับค่าของจำนวนเต็มลบนั้น

รูปเเบบ Input
รับจำนวนเต็มบวกทีละบรรทัดอย่างน้อย 1 จำนวนและบรรทัดสุดท้ายรับจำนวนเต็มลบ

รูปเเบบ Output
ตัวเลขชุดใหม่ที่เกิดจากการเอาตัวเลขเดิมรวมกับตัวเลขติดลบตัวสุดท้ายนั้น

ตัวอย่างที่1
Input:
1
2
3
4
-5

Output:
-4
-3
-2
-1

'''

b = []
c = None

while True:
  a = int(input())
  if a >=0:
    b.append(a)
  else:
    c = a
    break

d = list(map(lambda x:x+c, b))    

for i in d:
  print(i)
