'''
คำอธิบาย
เด็กชายเดิฟเดินทางเข้าไปในป่าแห่งหนึ่ง อยู่ดีๆก็เกิดฟ้าร้องฟ้าผ่าแต่เด็กชายเดิฟสามารถเดินฝ่าเข้าไปได้อย่างชิวจนกระทั่งหลุดเข้ามาในมิติกระจก ต่อมาเด็กชายเดิฟต้องการกลับบ้านแต่หากจะกลับต้องตรวจสอบว่าข้อความในป้ายเป็น Palindrome หรือไม่ ผลข้างเคียงจากฟ้าผ่าฟ้าร้องเพิ่งจะแผลงฤทธิ์ทำให้เด็กชายเดิฟสมองเสื่อมไปชั่วขณะ ช่วยเขียนโปรแกรมเพื่อเช็คว่าข้อความเป็น Palindrome หรือไม่แทนเด็กชายเดิฟที!
Palindrome คือ คำ วลี จำนวนหรือลำดับที่สามารถอ่านจากหลังไปหน้าหรือหน้าไปหลังแล้วมีความหมายเหมือนกัน

รูปเเบบ Input
บรรทัดที่ 1 รับข้อความที่ต้องการจะตรวจสอบว่าเป็น Palindrome หรือไม่

รูปเเบบ Output
แสดงผลเป็นรูปแบบข้อความในบรรทัดที่ 1 ว่า “Yes” หาก Input เป็น Palindrome และ "No" หาก Input ไม่เป็น Palindrome

ตัวอย่างที่1
Input:
DerpInwZa007

Output:
No

ตัวอย่างที่2
Input:
malayalam

Output:
Yes

'''
get =input()

def palindrome(get):
  if get == get[::-1]:
    print("Yes")
  else:
    print("No")
    
if __name__ == "__main__":
  palindrome(get)

