'''
คำอธิบาย
ในโจทย์ข้อนี้เราจะให้คุณหาค่ามากที่สุดใน 4 จำนวนที่เป็นข้อมูลนำเข้า

รูปเเบบ Input
ข้อมูลนำเข้ามี 4 บรรทัด
บรรทัดที่ 1 คือ จำนวนที่ 1
บรรทัดที่ 2 คือ จำนวนที่ 2
บรรทัดที่ 3 คือ จำนวนที่ 3
บรรทัดที่ 4 คือ จำนวนที่ 4

รูปเเบบ Output
ข้อมูลส่งออกมีบรรทัดเดียว คือจำนวนที่มากที่สุดใน 4 จำนวนนี้

ข้อจำกัด
จำนวนใน 4 จำนวนนี้อาจติดทศนิยมได้
จำนวนใน 4 จำนวนนี้อาจมีสองหรือสามหรือสี่ตัวที่ซ้ำกัน

ตัวอย่างที่1
Input:
1
2
3

Output:
3

ตัวอย่างที่2
Input:
-1
-1
-1

Output:
-1

ตัวอย่างที่3
Input:
-80
0
44

Output:
44
'''
num = [input() for i in range(3)]

num_c = []
for i in num:
  if "." in i:
    num_c.append(float(i))
  else:
    num_c.append(int(i))
    
#print(num_c)
print(max(num_c))
