'''
คำอธิบาย
สมมติในยุคสมัยของอนาคต 2077 ผู้คนต่างใช้เลข 105 ในชีวิตประจำวัน เช่น ของทุกอย่างราคา 105 บาท, อายุขัยของมนุษย์จะมากกว่า 105 ปี, มีธนบัตร 105 บาท เป็นต้น ซึ่งแม้แต่คุณ ก็ยังหลงใหลกับเลข 105 เหมือนกัน
วันหนึ่ง คุณสงสัยว่า "ถ้ามีจำนวนเต็มบวกจำนวนหนึ่งว่าสามารถหารด้วย 105 ลงตัวหรือไม่" คุณคิดจนสมองจะระเบิด เลยนึกได้ว่า "ไปเขียนโปรแกรมดีกว่า ^_^"
โจทย์ จงตรวจสอบว่าจำนวนเต็มบวกนี้เป็นจำนวนที่หารด้วย 105 ลงตัวหรือไม่ ถ้าลงตัว ให้พิมพ์ "YES" ถ้าไม่ลง พิมพ์ "NO" เป็นรวมทั้งหมด T จำนวน

รูปเเบบ Input
บรรทัดแรก รับจำนวนเต็มบวก T แทนจำนวนครั้งที่ต้องการจะตรวจสอบ
บรรทัดที่ 2 ถึง T+1 รับจำนวนเต็มบวกที่ต้องการจะตรวจสอบว่าหารด้วย 105 ลงตัวหรือไม่

รูปเเบบ Output
มีจำนวน T บรรทัด คือคำตอบของแต่ละคำถาม บรรทัดละคำตอบ
ถ้าลงตัวให้พิมพ์คำว่า "YES"
ถ้าไม่ลงให้พิมพ์คำว่า "NO"

ข้อจำกัด
T เป็นจำนวนเต็มบวก โดยที่ T<=100
และจำนวนเต็มบวกที่ต้องการตรวจสอบจะมีค่าอย่างมากคือ 10^1001 (อ่านว่า 10 ยกกำลัง 1001)
(ตรงนี้ที่ทำให้โจทย์ยากขึ้น เพราะ 10^1001 มีค่ามากกว่า int หรือ long long ดังนั้น คุณต้องเขียนโปรแกรมที่มีประสิทธิภาพให้ได้)

ตัวอย่างที่1
Input:
1
105

Output:
YES

ตัวอย่างที่2
Input:
3
50085
5984
9850

Output:
YES
NO
NO

ตัวอย่างที่3
Input:
1
513643995849381705

Output:
YES
'''
num = int(input())

source = [int(input()) for i in range(num)]

[(print("YES") if i%105==0 else print("NO")) for i in source ]



'''
def do():
  for i in source:
    if i %105 ==0:
      print("YES")
    else:
      print("NO")
do()

'''
