'''
คำอธิบาย
ชายคนหนึ่งนำแท่งเหล็กที่ยาว m เมตร ไปตัดเป็น 3 ท่อน โดยท่อนแรกยาว a เมตร ท่อนที่ 2 และ 3 ยาว b เมตร จากนั้นนำไปล้อมด้านหนึ่งของกำแพงเป็นรูปสี่เหลี่ยมมุมฉากในลักษณะดังนี้

  wwwwwwwww
⠀ |⠀⠀⠀⠀⠀⠀|
⠀ |⠀⠀⠀⠀⠀⠀|
⠀ ========

เมื่อ :
w คือกำแพง
==== คือ แท่งเหล็กท่อนที่ยาว a เมตร
| คือแท่งเหล็กท่อนที่ยาว b เมตร
จงหาว่า แท่งเหล็กที่ยาว m เมตร จะสามารถทำให้เกิดพื้นที่ได้มากที่สุดกี่ตารางเมตร

รูปเเบบ Input
บรรทัดที่ 1 : ความยาวของแท่งเหล็กยาว m เมตร (จำนวนเต็ม)

รูปเเบบ Output
บรรทัดที่ 1 : พื้นที่ที่มากที่สุดที่สามารถล้อมได้ (อาจเป็นทศนิยมหรือจำนวนเต็มก็ได้)

ข้อจำกัด
Output
ในกรณีที่เป็นทศนิยมต้องเป็นทศนิยม 2 ตำแหน่งเท่านั้น (แม้ว่าทศนิยมตำแหน่งที่ 2 จะเป็น 0 ก็ตาม เช่น 3.20)
ในกรณีที่เป็นจำนวนเต็มให้ระบุคำตอบเป็นจำนวนเต็ม เช่น 1 , 2 , 3 , 4 , ...
a + 2b = m เสมอ
m เป็นจำนวนเต็มบวก
a และ b เป็นจำนวนจริงบวก (a และ b มากกว่า 0 เสมอ)

ตัวอย่างที่1
Input:
2

Output:
0.50

ตัวอย่างที่2
Input:
8

Output:
8

ตัวอย่างที่3
Input:
16

Output:
32
'''
m = int(input())

a = m/2
b = m/4

if a*b %1 ==0:
  print(int(a*b))
else: 
  print(f"{a*b:.2f}")
