'''
คำอธิบาย
จงเขียนโปรเกรมแม่สูตรคูณ

รูปเเบบ Input
n=เลขแม่สูตรคุณ

รูปเเบบ Output
แสดงแม่สูตรคูณของn

ข้อจำกัด
Input จะต้องเป็นจำนวนที่ไม่ติดลบ


ตัวอย่างที่1
Input:
2

Output:
2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18
2 * 10 = 20
2 * 11 = 22
2 * 12 = 24

ตัวอย่างที่2
Input:
5

Output:
5 * 1 = 5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45
5 * 10 = 50
5 * 11 = 55
5 * 12 = 60

ตัวอย่างที่3
Input:
99

Output:
99 * 1 = 99
99 * 2 = 198
99 * 3 = 297
99 * 4 = 396
99 * 5 = 495
99 * 6 = 594
99 * 7 = 693
99 * 8 = 792
99 * 9 = 891
99 * 10 = 990
99 * 11 = 1089
99 * 12 = 1188
'''

num  = int(input())

def mul_fomula(num):
  for i in range(1, 13):
    print(f"{num} * {i} = {i*num}")
    
mul_fomula(num)
