'''
คำอธิบาย
นายทนงยืนอยู่บนเมฆสีทองที่มีความสูง h และเค้ากำลังปล่อยลูกบอลคู่ใจของเขาลงมาจากบนนั้นและลูกบอลของเค้าเมื่อตกถึงพื้นจะกระเด้งกลับมา 4/5 ของระยะทางที่ตกลงมา จงแสดงผลระยะทางที่เจ้าลูกบอลทำขึ้น

รูปเเบบ Input
รับค่าความสูงมาเก็บไว้ที่ตัวแปร H

รูปเเบบ Output
แสดงผลระยะทางที่ลูกบอลทำขึ้นมา

ข้อจำกัด
H >= 1

ตัวอย่างที่1
Input:
97m

Output:
873m

ตัวอย่างที่2
Input:
125m

Output:
1125m

ตัวอย่างที่3
Input:
743m

Output:
6687m
'''
import re

H = input()
H = re.findall("\d+", H)
H = int(H[0])
C = H
r = 4/5
a = C

while C >= 0.000001:
  a += C*r
  C = C*r

result = a*2 - H
print(str(round(result))+"m")

