'''
คำอธิบาย
Number Square
ให้เขียนโปรแกรมรับค่าจำนวนเต็ม (int) n เข้ามา
จากนั้นพิมพ์สี่เหลี่ยมจตุรัสขนาด n x n โดยสร้างด้วยตัวอักษร "n"

รูปเเบบ Input
ค่า n
รูปแบบ Output
สี่เหลี่ยมจตุรัสขนาด n x n ที่สร้างด้วยอักขระ "n"

ข้อจำกัด
ถ้าสร้างไม่ได้ให้พิมพ์ ERROR
n เป็นเลขหลักเดียว

ตัวอย่างที่ 1
ข้อมูลขาเข้า
3

ผลลัพธ์
333
333
333

ตัวอย่างที่ 2
ข้อมูลขาเข้า
5

ผลลัพธ์
55555
55555
55555
55555
55555

ตัวอย่างที่ 3
ข้อมูลขาเข้า
-8

ผลลัพธ์
ERROR
'''

num = int(input())

def show(num):
  if num < 1 :
    print("ERROR")
  else:
    for i in range(num):
      print(f"{num}"*num)

show(num)
