'''
คำอธิบาย
จำนวนเต็มที่ชํ้ากัน โดยให้เอาแค่ตัวเดียว

รูปเเบบ Input
1, 4, 1, 2, 5, 2, 4, 7, 4, 9

รูปเเบบ Output
1, 2, 4, 5, 7, 9

ข้อจำกัด
จัดเรียงค่าน้อยสุดหาใหญ่สุด

ตัวอย่างที่1
Input:
34
39
37
34
39
35

Output:
[34, 35, 37, 39]

ตัวอย่างที่2
Input:
2
2
6
3
6
4

Output:
[2, 3, 4, 6]

ตัวอย่างที่3
Input:
19
17
12
17
10
17

Output:
[10, 12, 17, 19]
'''
num = [int(input())for i in range(6)]

num = set(num)
num = list(num)
num = sorted(num)
print(num)
