'''
คำอธิบาย
วันหนึ่งคุณตื่นขึ้นมาอยู่ที่ห้องใครไม่รู้กับโน๊ตบุ๊คเครื่องหนึ่งที่อยู่ในมือของคุณ เมื่อลองมองไปนอกหน้าต่างก็พบว่านี้มันไม่ใช่โลกที่คุณรู้จัก จู่ๆ ก็มีคนเปิดประตูห้องเข้ามาและพบว่าเขาคือตัวคุณเองในอีกจักรวาล ตัวคุณอีกคนหนึ่งรู้สึกตกใจเมื่อได้เห็นคุณ และเข้ามาคุยเกี่ยวกับอาชีพและโลกของคุณ คุณได้เล่าให้เขาฟังว่าตัวคุณเป็นโปรแกรมเมอร์และสามารถเขียนโปรแกรมได้ เมื่อเขาได้ฟังเรื่องที่คุณบอกจึงปิ๊งไอเดียขึ้นมาได้ ตัวคุณอีกคนนึงเล่าว่าตอนนี้เขากำลังจะเปิดร้านขายของชำ แต่ว่าในโลกของเขานั้นไม่มีเทคโนโลยีที่ช่วยในการคิดเงิน เขาจึงขอให้คุณช่วยเขียนโปรแกรมช่วยคิดเงินแบบโปรโมชั่นด้วยโน๊ตบุ๊คที่ติดมาด้วย
โปรแกรมที่เราจะสร้างนั้นประกอบไปด้วย

ค่า x แทน จำนวนที่ซื้อ
ค่า y แทน จำนวนที่แถม
ค่า z แทน จำนวนสินค้าที่ลูกค้าหยิบมาวาง
ค่า m แทน ราคาสินค้าต่อชิ้น

ตัวอย่างเช่น ซื้อ 3 แถม 1 ราคา 20 บาทต่อชิ้น ลูกค้านำสินค้ามาวาง 8 ชิ้น
x = 3 , y = 1 , z = 8 , m = 20

รูปเเบบ Input
บรรทัดแรก : รับค่า x และ y (เว้น 1 ช่องระหว่างกัน)
บรรทัดสอง : รับค่า z
บรรทัดสาม : รับค่า m

รูปเเบบ Output
บรรทัดแรก : ราคารวมทั้งหมดที่ลูกค้าต้องจ่าย
ในกรณีที่ลูกค้าลืมอ่านป้ายโปรโมชั่นและลูกค้าลืมหยิบสินค้าที่แถมมา ให้แสดงประโยคว่า
"Get ... free" ในบรรทัดที่สอง โดยที่ ... คือค่า y

ข้อจำกัด
x >= y > 0
m > 0
z > 0

ตัวอย่างที่1

Input:
3 1
4
30

Output:
90
2

ตัวอย่างที่2
Input:
5 2
5
50
Output:

250
Get 2 free

ตัวอย่างที่3
Input:
2 2
5
15

Output:
45
'''

num_product, free = [int(i) for i in input().strip().split(" ")]
num_all = int(input())
price = int(input())


if num_product + free > num_all:
  print(num_all * price)
  print(f"Get {free} free")
else:
  all = num_product + free
  num_price = num_product * (num_all // all)
  rest = num_all % all
  
  if rest:
    num_price += rest
  
  print(num_price * price)
  
  if (rest == free) and (num_product == free):
    print(f"Get {free} free")
