'''
คำอธิบาย
รวมโจทย์ชุดที่ 1 (ข้อที่ 1/6) (ระดับความยาก 1 ดาว)
วันเปิดภาคเรียนกำลังใกล้เข้ามาขึ้นทุกที หลังจากปิดเทอมอันแสนยาวนาน เด็กชาย A เป็นเด็กนักเรียนธรรมดา อาศัยอยู่ย่านบางแค เมื่อรู้ว่าเปิดเทอมแล้วก็ตื่นเต้นอย่างมากที่จะได้ไปโรงเรียน แต่ก็กลับมาคิดว่า
"เราต้องเข้าเรียนก่อน 08:00 (08:00 ถือว่าทันเวลา) ถ้าเราเดินทางจากบ้านไปโรงเรียนใช้เวลา n นาที จะต้องออกจากบ้านอย่างช้าสุดเวลาเท่าไหร่"
งานของคุณ จงเขียนโปรแกรมซึ่งรับค่า n แล้วแสดงผลออกมาเป็นเวลาอย่างช้าสุดที่สามารถไปโรงเรียนได้ทันเวลา

รูปเเบบ Input
มีบรรทัดเดียว รับจำนวนเต็ม n คือ เวลาในการเดินทางจากบ้านไปโรงเรียน มีหน่วยเป็นนาที

รูปเเบบ Output
มีบรรทัดเดียว แสดงเป็นเวลาแบบ hh:mm คือเวลาอย่างช้าสุดที่สามารถไปโรงเรียนได้ทันเวลา

ข้อจำกัด
n เป็นจำนวนเต็มบวก โดยที่ 1<=n<=60

คำอธิบายตัวอย่างที่ 1: จากบ้านไปโรงเรียนใช้เวลา 2 นาที ดังนั้น เด็กชาย A สามารถออกจากบ้านได้อย่างช้าสุดคือเวลา 07:58 น.

ตัวอย่างที่1
Input:
2

Output:
07:58

ตัวอย่างที่2
Input:
12

Output:
07:48

ตัวอย่างที่3
Input:
51

Output:
07:09
'''
trip_time =  int(input())

hr = 7
minute = 60
count = 0

while trip_time >0:
  trip_time -= 1
  minute -= 1
  count += 1
  if minute == 0:
    minute = 60
  if count == 61:
    hr -= 1
    count = 1
    
if minute == 60:
  minute = 0
  
hr_str = "0"+str(hr)
if len(str(minute)) ==1:
  minute_str = "0" + str(minute)
if len(str(minute)) ==2:
  minute_str = str(minute)

print(f"{hr_str}:{minute_str}")
