'''
คำอธิบาย
[โจทย์ตามคำขอของคุณ Teerapath P.]
โดยเราจะใช้สูตร
(a+b)^2 = a^2 + 2ab + b^2 และ
(a-b)^2 = a^2- 2ab + b^2

เราจะรับinput a และ b
แล้วเ output อกกมาเป็นสองสูตร
รูปเเบบ Input
เราจะรับinput a และ b ที่เป็นจำนวนเต็ม โดยอยู่คนละบรรทัด
เช่น
1
2

รูปเเบบ Output
ออกมาเป็นคำตอบทั้งสองสูตร โดยจะอยู่คนละบรรทัด
เช่น
25 (สูตรผลบวก)
10 (สูตรผลลบ)

ตัวอย่างที่1
Input:
3
2

Output:
25
1
'''

a, b = [int(input()) for i in range(2)]

p = a**2+(2*a*b)+b**2
m = a**2-(2*a*b)+b**2

print(p)
print(m)
