'''
คำอธิบาย
พาลินโดรม คือ ตัวเลข, คำหรือแม้แต่วลีที่มีสมมาตรซ้ายขวาที่ไล่จากด้านหน้าไปด้านหลังจะ
ให้ผลเหมือนกับข้างหลังไปข้างหน้า เช่น 1 (เลขหรือตัวอักษรเพียงแค่ตัวเดียวก็ถือได้ว่าเป็นพาลินโดรม),
1991 หรือคำว่า radar เป็นต้น ลองเขียนโปรแกรมเพื่อตรวจสอบข้อมูลที่รับเข้ามาว่าเป็นพาลินโดรมหรือไม่

รูปเเบบ Input
รับข้อมูลที่ต้องการตรวจสอบ

รูปเเบบ Output
ผลการตรวจสอบถ้าใช่ให้ขึ้นข้อความ Yes ถ้าไม่ใช่ให้ขึ้นข้อความ No

ข้อจำกัด
ข้อมูล input เอาเป็นแค่คำหรือตัวเลขก็พอฮะ

ตัวอย่างที่1
Input:
rotator

Output:
Yes
'''

palin = input().lower()
def pa(pal):
  return palin == palin[::-1]

if pa(palin):
  print("Yes")
else:
  print("No")
