'''
คำอธิบาย
ช่วงนี้ร้านแพนเค้กขาดทุน ดังนั้นจึงจัดโปรโมชั่นใหม่ ดังนี้

แถมคูปองและถาดรองแพนเค้กให้ โดย 1 คูปอง/ชิ้น และ 1 ถาด/ชิ้น ทุกครั้งที่ได้รับแพนเค้กจากร้านนี้
เมื่อสะสมครบ 2 คูปอง จะสามารถนำมาแลกแพนเค้กเพิ่มได้ 1 ชิ้นฟรี
เมื่อสะสมครบ 4 ถาด จะสามารถนำมาแลกแพนเต้กเพิ่มได้ 1 ชิ้นฟรี
คุณเป็นโปรแกรมเมอร์หัวไว เมื่อเห็นโปรโมชั่นของร้านนี้แล้ว จึงกลับมาคิดว่า ถ้ามีเงินอยู่ n บาท และแพนเค้กชิ้นละ k บาท จะได้รับแพนเค้กมากสุดกี่ชิ้น???

รูปเเบบ Input
มีบรรทัดเดียว รับจำนวนเต็ม 2 จำนวน n,k คั่นด้วยช่องว่าง 1 ช่อง แทนเงินของคุณและราคาแพนเค้กต่อชิ้นตามลำดับ

รูปเเบบ Output
มีบรรทัดเดียว แสดงผลเป็นจำนวนแพนเค้กมากสุดที่จะได้รับ

ข้อจำกัด
n และ k เป็นจำนวนเต็มบวก โดยที่ k<n และ n<=100000

ตัวอย่างที่1
Input:
20 3

Output:
19

ตัวอย่างที่2
Input:
15 4

Output:
7
3

ตัวอย่างที่3
Input:
100 10

Output:
35
'''
n, k = input().split(" ")
n, k = int(n), int(k)

num = n//k
coupon = 0
tray = 0
total = 0
while num>=1:
  num -= 1
  tray +=1
  coupon +=1
  total +=1
  if tray == 4:
    num += 1
    tray = 0
  if coupon == 2:
    num +=1
    coupon =0



print(total)
