'''
คำอธิบาย
ให้หาด้านตรงข้ามมุมฉาก โดยใช้สูตร
a กำลังสอง + b กำลังสอง = c กำลังสอง
หรือ (a * a) + (b * b) = (c * c)
โดย a , b = ด้านประกอบมุมฉาก
c = ด้านตรงข้ามมุมฉาก
(ใบ้ให้ใช้ double)

รูปเเบบ Input
รับจำนวนเต็มสองตัว เช่น
1
1

รูปเเบบ Output
ออกมาเป็นทศนิยม 2 ตำแหน่ง หนึ่งจำนวน เช่น
1.41

ข้อจำกัด
output เป็นทศนิยม 2 ตำแหน่ง (ปัดเศษทศนิยมแบบ round)
ไม่ต้องแสดงทศนิยมถ้าไม่มีเศษ

ตัวอย่างที่1
Input:
1
1

Output:
1.41

ตัวอย่างที่2
Input:
5
12

Output:
13
'''

import math

a =[int(input()) for i in range(2)]

b = a[0]**2 + a[1]**2
c = round(math.sqrt(b),2)
if c%1==0:
  print(int(c))
else:
  print(f"{c:.2f}")
