'''
คำอธิบาย
เมธีต้องการบวกเลขคณิตศาสตร์ แต่ตัวเลขที่ต้องการบวกเรียงมาไม่สวย เพราะตัวเลขไม่ได้เรียงจากน้อยไปมาก! มันบวกยาก ไม่มีชั้นเชิง ฉะนั้นเราต้องเขียนโปรแกรมสำหรับการเรียงเลขให้กับเมธี ก่อนที่เมธีจะได้บวกเลขได้อย่างมีชั้นเชิง

รูปเเบบ Input
ข้อความ 1 บรรทัด เป็นประโยคสัญลักษณ์

รูปเเบบ Output
ประโยคสัญลักษณ์ที่ทำการเรียงเลขจากน้อยไปมากแล้ว

ข้อจำกัด
ประโยคสัญลักษณ์จะใช้เครื่องหมายบวกเท่านั้น และตัวเลขที่นำมาบวกกันจะมีค่าตั้งแต่ 0 - 99999

ตัวอย่างที่1
Input:
3+5+1+8+9

Output:
1+3+5+8+9
'''

get = input()
get = get.split("+")
get = list(map(int, get))
get = sorted(get)
#get = list(map(str, get))
get = [str(i) for i in get]
get = "+".join(get)
print(get)
