'''
คำอธิบาย
ในการคัดแยกพัสดุในการส่งสินค้าจะต้องทำการหาสินค้าที่ต้องการออกมาเพื่อทำการส่งให้กับลูกค้า โดนเราจะต้องเขียนโปรแกรมที่ใช้ในการหาว่าสินค้าที่ต้องการอยู่ตำแหน่งใด!
โดยพนักงานจะใส่จำนวนของสินค้าทั้งหมด n จำนวน แล้วทำการใส่รหัสของพัสดุลงไปตามจำนวน n หลังจากนั้นจึงทำการใส่เลขพัสดุที่ต้องการหาเป็นอย่างสุดท้าย

รูปเเบบ Input
บรรทัดแรก n เป็นจำนวนของสินค้าทั้งหมด
บรรทัด n ต่อไป เป็นรหัสสินค้าเป็นเลขจำนวนเต็ม
บรรทัดสุดท้ายเป็นรหัสสินค้าที่ต้องการหา เป็นเลขจำนวนเต็ม

รูปเเบบ Output
บรรทัดแรก เป็นเลขตำแหน่งที่ของสินค้าที่ต้องการเช่น Posiotion: 1,3,5 หากไม่มีสินค้าอยู่ให้ทำการแสดงข้อความ "Not Found"

ข้อจำกัด
1<n<100

ตัวอย่างที่1
Input:
5
1
2
1
2
1
1

Output:
Position: 1,3,5
'''
num = int(input())
total = [int(input()) for i in range(num)]
find = int(input())
A=[]
for idx,get in enumerate(total):
  if find == get:
    A.append(str(idx+1))
if len(A)==0:
  print("Not Found")
else:
  c = ",".join(A)
  print(f"Position: {c}")
