'''
คำอธิบาย
*Story of your* คุณเป็นโปรแกรมเมอร์ที่ฉลาดหลักแหลม แต่เพราะเหตุนั้นคุณจึงถูกฆ่าตายเพราะความอิจฉาของคนรอบข้าง และได้เกิดใหม่ในร่างของ ' เบล ' เด็กชายผู้ที่จะกลายเป็นบอสตัวสุดท้ายของนิยายแฟนตาซีที่คุณเคยอ่านก่อนตาย
ตอนนี้คุณ(เบล) อายุ 5 ขวบแล้วและความทรงจำของคุณในชาติที่แล้วก็ได้กลับคืนมา ถึงเวลาโชว์เทพด้วยการใช้พลังเวทย์ผ่านกระบวนความคิดทางคณิตศาสตร์แล้ว !!!

โจทย์
คุณได้อ่านหนังสือเวทมนตร์เป็นจำนวนมากกว่าหนึ่งร้อยเล่ม และได้เรียนรู้ว่าธาตุของเวทมนตร์จะแบ่งออกเป็นตัว เลขฐานสิบ ดังนี้
Fire = 0, Water = 1, Wind = 2, Ground = 3, Light = 4, Dark = 5 | เนื่องจากคุณเป็นตัวร้าย จึงสนใจในเวทมนตร์ธาตุความมืด และพบว่าหากจะต้องเรียนรู้เวทมนตร์ในระดับที่เจาะลึกจะต้องใช้ เลขฐานสอง เข้ามาร่วมด้วย คุณจึงอยากรื้อฟื้นความทรงจำเกี่ยวกับเลขฐานสอง เพราะงั้นโจทย์นี้จึงเกิดขึ้น :)
รูปเเบบ Input
รับค่าธาตุแต่ละบรรทัดเป็น Type: String

รูปเเบบ Output
แสดงเลขฐานสองที่แทนค่าในธาตุนั้น ๆ ออกมา

ข้อจำกัด
เลขฐานสองที่แสดงออกมาจะ 20 Bits Binary เท่านั้น

ตัวอย่างที่1
Input:
Water

Output:
00000000000000000001

ตัวอย่างที่2
Input:
sadjnesxz

Output:
No have this mahou in your library.
'''
get = input()
zero = "0"*16

a=None
if get =="Fire":
  a = zero+"0000"
elif get == "Water":
  a = zero+"0001"
elif get == "Wind":
  a = zero+"0010"
elif get == "Ground":
  a = zero+"0011"
elif get == "Light":
  a = zero+"0100"
elif get == "Dark":
  a = zero+"0101"
else:
  a= "No have this mahou in your library."

print(f"{a}")
