'''
คำอธิบาย
โจทย์จะให้จำนวนรอบที่วิ่งมา
แล้วแต่ละรอบ พี่ตูนจะได้ตังบริจากเท่ากัน
ให้เราบอกว่าวิ่ง รอบที่.. ได้เงินเท่าไหร่
และได้เงินทั้งหมดเท่าไหร่

รูปเเบบ Input
บรรทัดแรก จำนวนรอบที่วิ่ง เป็นจำนวนเต็ม
บรรทัดสองเป็นเงินที่ได้จากการวิ่งแต่ละรอบ
เช่น
2(รอบ)
20(เงินในแต่ละรอบ)

รูปเเบบ Output
แสดงอกกมาว่า รอบที่ .. ได้ เงินเท่าไหร่ และบรรทัดสุดท้ายบอกผลรวมเงินทั้งหมด
เช่น
1(รอบที่)-20(เงินในแต่ละรอบรอบ)
2-20
40(เงินรวม)

ข้อจำกัด
เงินแต่ละรอบเท่ากัน

Input:
4
20

Output:
1-20
2-20
3-20
4-20
80
'''

lap = int(input())
money = int(input())

for i in range(1, lap+1):
  print(f"{i}-{money}")
  
print(lap*money)
