'''
คำอธิบาย
เราอยากรู้ว่า เขากดวงกลมตามจังหวะเพลงได้แม่นขนาดไหนกันเชียว โดยสูตรคำณวณมีอยู่ว่า
Accuracy = ((50 * n50) + (100 * n100) + (300 * n300)) / (300 * (n0 + n50 + n100 + n300))

n0 คือ จำนวนครั้งที่กดได้แต้ม 0
n50 คือ จำนวนครั้งที่กดได้แต้ม 50
n100 คือ จำนวนครั้งที่กดได้แต้ม 100
n300 คือ จำนวนครั้งที่กดได้แต้ม 300

รูปเเบบ Input
รับเป็นจำนวนครั้งของแต้มที่กดได้ เรียงลำดับจาก 300, 100, 50, 0

รูปเเบบ Output
แสดงเป็นเลขทศนิยมสองหลักตามด้วย % เสมอ เช่น 99.25%, 100.00%

ข้อจำกัด
C++ ให้ลองใช้ setprecision() (#include <iomanip>) ในการทำให้เป็นทศนิยมสองจุดดูนะครับ

ตัวอย่างที่1
Input:
565
16
0
0

Output:
98.16%

ตัวอย่างที่2
Input:
689
98
8
4

Output:
90.49%

ตัวอย่างที่3
Input:
640
321
52
104

Output:
67.65%
'''
T, H, F, Z = [int(input()) for i in range(4)]

Accuracy = ((50 * F) + (100 * H) + (300 * T)) / (300 * (Z + F + H + T)) *100

print(f"{Accuracy:.2f}%")
