'''
คำอธิบาย
วิศวะกรท่านหนึ่งต้องการจะออกแบบห้องที่มี ความกว้างและความยาวเท่ากัน โดยต้องการหาโปรแกรมเมอร์ผู้เก่งกาจมาร่วมงานในครั้งนี้ และหวังว่าจะเจอโปรแกรมเมอร์คนนั้นโดยเร็ว

รูปเเบบ Input
input เป็นตัวเลขจำนวนเต็ม มีบรรทัดเดียวเพื่อกำหนดความกว้างของห้อง

รูปเเบบ Output
output จะแสดงตัวเลขที่เรียงเป็นความกว้างและยาวเท่าๆกัน เช่น

00000000000
01111111110
01222222210
01233333210
01234443210
01234543210
01234443210
01233333210
01222222210
01111111110
00000000000
แอบยากนิดหน่อย

ข้อจำกัด
input จะมีค่าตั้งแต่ 1-9

ตัวอย่างที่1
Input:
3

Output:

0000000
0111110
0122210
0123210
0122210
0111110
0000000

ตัวอย่างที่2
Input:
5

Output:
00000000000
01111111110
01222222210
01233333210
01234443210
01234543210
01234443210
01233333210
01222222210
01111111110
00000000000

ตัวอย่างที่3
Input:
7

Output:
000000000000000
011111111111110
012222222222210
012333333333210
012344444443210
012345555543210
012345666543210
012345676543210
012345666543210
012345555543210
012344444443210
012333333333210
012222222222210
011111111111110
000000000000000
'''
r = int(input())

for row in range(r):
  initail_list = [i for i in range(row+1)]
  list_r = [i for i in range(row+1)] + [initail_list[-1]]*((2*r - (len(initail_list)))-row) + [i for i in range(row+1)][::-1]
  for column in list_r:
    print(column, end="")
  print("")
mid_list_in = [i for i in range(r+1)]
mid = mid_list_in + mid_list_in[:-1][::-1]
for row_m in mid:
    print(row_m, end="")
print("")

for row in range(r-1,-1,-1):
  initail_list = [i for i in range(row+1)]
  list_r = [i for i in range(row+1)] + [initail_list[-1]]*((2*r - (len(initail_list)))-row) + [i for i in range(row+1)][::-1]
  for column in list_r:
    print(column, end="")
  print("")
