'''
คำอธิบาย
Sam ได้ตั้งระบบสมัครสมาชิกและล็อกอินไว้สำหรับการลงทะเบียนรับคอร์สฟรี
โดยหลังจากที่ลงทะเบียบแล้วต้องล็อกอินอีกครั้ง หากรหัสผ่านไม่ตรงกันจะไม่สามารถลงทะเบียนเรียนฟรีได้

รูปเเบบ Input
สร้างตัวแปรเก็บชื่อและรหัสผ่านสสำหรับสมัครสมาชิก
และสร้างตัวแปรเก็บชื่อและรหัสผ่านสำหรับล็อกอิน
หากรหัสผ่านไม่ตรงกันจะวนซ้ำไม่สิ้นสุด

รูปเเบบ Output
เข้าได้ แสดง Success
ผิด แสดง Error

ตัวอย่างที่1

Input:
name : Rati
password : 123456789
name(login) : Rati
password(login) : 12345678

Output:
Success
'''
a = [input() for i in range(4)]

c=[]
for i in a:
  b = i.split(":")
  c.append(b[1])

d = c[0:2]
e = c[2:4]

if d==e:
  print("Success")
else:
  print("Error")
