'''
คำอธิบาย
วันหนึ่งคุณเดินอยู่ริมถนน ได้เห็นป้ายโฆษณาว่ามีเศรษฐีรวยพันล้าน ต้องการแจกเงินให้กับคนที่ดวงดีเพียงคนเดียวเท่านั้น แน่นอนว่าคุณต้องอยากลองเสี่ยงดวงสักหน่อย
เมื่อถึงสถานที่ที่นัดพบ มีคนอยู่ทั้งหมด N คน รวมคุณด้วย ต้องการอยากจะได้เงินก้อนโตนี้ เมื่อถึงเวลาแล้ว จะให้คนทั้งหมด N คนนั้นเลือกหมายเลขที่จะติดเสื้อ มีหมายเลขตั้งแต่ 1-N ไม่ซ้ำกัน จากนั้นจะให้ต่อแถวเรียงตั้งแต่หมายเลข 1 ถึงหมายเลข N
ภาพที่ 1 การต่อแถวเมื่อ N = 5
เศรษฐีให้ผู้เล่นไล่จากต้นแถว ก็คือไล่จากหมายเลข 1 ให้พูด เลข 1 คนต่อไป เลข 2 สลับ 1-2-1-2 ไปเรื่อย ๆ โดยที่คนที่พูดหมายเลข 1 ให้ไปต่อหลังแถว ส่วนคนที่พูดหมายเลข 2 จะไม่ได้เงิน และกลับบ้านไป ถ้าอยู่รอดเป็นคนสุดท้าย คนนั้นจะได้เงินก้อนโต


ตัวอย่าง การเล่นเกมเมื่อ N = 5
https://imgur.com/a/XP0xUAn
(DevLab แนบรูปใหญ่ๆไม่ได้)


แน่นอนคุณมองว่านี่ไม่ใช่เกมเสี่ยงดวง มันขึ้นอยู่กับการเลือกหมายเลข จงหาว่าต้องเลือกหมายเลขใดจึงจะชนะ
งานของคุณ รับจำนวนคน แล้วบอกว่าให้เลือกหมายเลขใดจึงจะชนะ

รูปเเบบ Input
มีบรรทัดเดียว รับจำนวนเต็มบวก N คือจำนวนคน

รูปเเบบ Output
มีบรรทัดเดียว แสดงผลเป็นหมายเลขที่ชนะ

ข้อจำกัด
ข้อจำกัดของ Easy Version - N<=1000
ปัญหาย่อยที่ 1 (2 Testcases) N<=10
ปัญหาย่อยที่ 2 (2 Testcases) N อยู่ในรูปของ 2^m เมื่อ m เป็นจำนวนเต็มบวกและ m<=6
ปัญหาย่อยที่ 3 (4 Testcases) ไม่มีเงื่อนไขเพิ่มเติม (N<=1000)


ตัวอย่างที่1
Input:
3

Output:
3

ตัวอย่างที่2
Input:
4

Output:
1

ตัวอย่างที่3
Input:
5

Output:
3
'''

num = int(input())

num = list(range(1, num+1))

check_state = 1

while len(num) >1:
  if check_state == 1:
    num_back = num.pop(0)
    num.append(num_back)
    check_state = 0
  elif check_state == 0:
    num.pop(0)
    check_state = 1


print(num[0])
