'''
คำอธิบาย
มีนักวิ่ง 2 คน (R1,R2) วิ่งโดยเริ่มที่จุด x1,x2 บนเส้นจำนวน ตามลำดับ (-10000<=x1<x2<=10000)
เมื่อเริ่มวิ่ง นักวิ่งจะวิ่งไปทางขวาของเส้นจำนวนพร้อมกัน โดย R1 วิ่งด้วยอัตราเร็ว v1 หน่วย/วินาที และ R2 วิ่งด้วยอัตราเร็ว v2 หน่วย/วินาที (1<=v2<v1<=100) และอัตราเร็วทั้งคู่จะไม่เพิ่มไม่ลด
จงหาว่า R1 ใช้เวลากี่วินาทีในการแซง R2

รูปเเบบ Input
มี 2 บรรทัด
บรรทัดที่ 1 รับค่าของจำนวนเต็ม x1 และ x2 แทนจุดเริ่มต้นของ R1 และ R2 บนเส้นจำนวน ตามลำดับ (-10000<=x1<x2<=10000)
บรรทัดที่ 2 รับค่าของจำนวนเต็ม v1 และ v2 แทนอัตราเร็วของ R1 และ R2 ตามลำดับ (1<=v2<v1<=100)
(สังเกตว่า v2<v1 และ x1<x2)

รูปเเบบ Output
มีบรรทัดเดียว แสดงผลเป็นจำนวนเต็มหน่วยวินาที ที่ R1 แซง R2 ได้

ข้อจำกัด
-10000<=x1<x2<=10000
1<=v2<v1<=100
**ถ้าคำตอบเป็นทศนิยม ให้ทำการปัดขึ้น

ตัวอย่างที่1
Input:
-2 8
3 2

Output:
10

ตัวอย่างที่2
Input:
3 20
5 1

Output:
5
3

ตัวอย่างที่3
Input:
-10 27
6 3

Output:
13
'''
x, y  = [int(i) for i in input().split(" ")]
v1, v2 =  [int(i) for i in input().split(" ")]

count = 0


while True:
  x += v1
  y += v2
  count += 1
  if x >= y:
    break
  
print(count)
