'''
คำอธิบาย
ในการเล่นปาเป้าอย่างง่าย ผู้เล่นจะต้องปาเป้า ให้แต้ม n ลดลงเรื่อยๆจนหมด
ซึ่งแผ่นเป้านั้นจะประกอบไปด้วยวงกลมซ้อนกันเป็นชั้นๆ โดยวงที่อยู่ในสุดจะมีคะแนนถึง 5 คะแนน และ
วงข้างนอกก็จะมีคะแนนลดลงไปเรื่อยๆ จนเหลือ 0 (ปาไม่โดนเป้า)นาย X เป็นนักกีฬามือโปร
เขามีความแม่นยำมากสามารถปาลงจุดใดของแผ่นเป้าก็ได้ แต่ถึงอย่างงั้น
เขาก็ยังจำเป็นต้องมีคุณเพื่อให้คุณช่วยในการคำนวณลูกดอกที่ต้องใช้
คุณจำเป็นต้องช่วยเขาคิดว่าเขาต้องใช้ลูกดอกอย่างน้อยกี่ดอกเพื่อให้สามารถปาจนแต้มหมดลงพอดี

ตัวอย่าง
n = 10
นาย X จำเป็นต้องใช้ลูกดอกอย่างน้อย 2 ดอก กล่าวคือ นาย X จะปาลงช่องที่มี 5 คะแนน ถึง 2 ครั้ง (5+5=10)

รูปเเบบ Input
รับค่าจำนวนเต็มบวก n

รูปเเบบ Output
จำนวนลูกดอกที่น้อยที่สุดที่นาย X ใช้

ข้อจำกัด
n ≤ 2,000,000,000

ตัวอย่างที่1
Input:
10

Output:
2
'''
a = int(input())

b = 0
while True:
  if a>=5:
    b += a//5
    a = a%5
  elif a==4:
    b += a//4
    a = a%4
  elif a==3:
    b += a//3
    a = a%3
  elif a==2:
    b += a//2
    a = a%2
  elif a==1:
    b += a//1
    a = a%1
  elif a==0:
    break
print(b)
