'''
คำอธิบาย
โปรแกรมนี้ เป็นโปรแกรมเครื่องคิดเลขแบบง่ายๆ มีการรับตัวเลข 2 ตัวเลขเพื่อทำการหาคำตอบต่อไป

รูปเเบบ Input
บรรทัดแรก: 30 << เป็นการรับข้อมูลตัวเลขตัวที่ 1
บรรทัดสอง: 50 << เป็นการรับข้อมูลตัวเลขตัวที่ 2
บรรทัดสาม: 3 << เป็นการรับข้อมูลจากผู้ใช้ว่าต้องการจะทำอะไร (ในที่นี้ คือการคูณ)
------

ปล.บรรทัดที่ 3 คือเป็นการถามผู้ใช้งาน
ว่าต้องการที่จะให้ข้อมูลตัวเลขที่เราเก็บมาจากบรรทัดที่ 1 และ 2 ทำอะไร

ถ้าหากผู้ใช้พิมพ์ 1: จะเป็นการดึงตัวเลขจากบรรทัดที่ 1 และ 2 มาทำการบวกกัน (+)
ถ้าหากผู้ใช้พิมพ์ 2: จะเป็นการดึงตัวเลขจากบรรทัดที่ 1 และ 2 มาทำการลบกัน (-)
ถ้าหากผู้ใช้พิมพ์ 3: จะเป็นการดึงตัวเลขจากบรรทัดที่ 1 และ 2 มาทำการคูณกัน (*)
ถ้าหากผู้ใช้พิมพ์ 4: จะเป็นการดึงตัวเลขจากบรรทัดที่ 1 และ 2 มาทำการหารกัน (/)

รูปเเบบ Output
1500

ตัวอย่างที่1
Input:
50
20
1

Output:
70

ตัวอย่างที่2
Input:
250
7
3

Output:
1750

ตัวอย่างที่3
Input:
19904
8
4

Output:
2488
'''
a, b, op = [int(input()) for i in range(3)]

result = {1:a+b, 2:a-b, 3:a*b, 4:a/b}

print(int(result[op]))
