'''
คำอธิบาย
เรื่องเล่าจากโจทย์
ต่อมาหลังจากรู้ได้ว่าเราสามารถทำโปรแกรมได้  "เด็กหญิงสมจริง กับ พีระมิดคู่ใจ(Offcial)" เด็กหญิงสมจริงดีใจสุดๆ พร้อมทั้งมีความคิดใหม่อยากให้เราทำอีกรูปหนึ่งที่สามารถเลือกจำนวนชั้นความสูง และสัญลักษณ์ที่แสดงเองได้ ด้วยสายตาที่เด็กหญิงสมจริงมองมา ทำให้ไม่มีใครที่จะกลั้นใจปฏิเสธได้ลง

มาเทอะพวกเรามาช่วยกันทำให้ความฝันของเด็กหญิงสมจริงเป็นจริงกัน

รูปเเบบ Input
รับค่าจำนวนความสูงของพีระมิด(N) ที่ 0 < N < 20
และรับเครื่องหมายสัญลักษณ์ เช่น * - $ หรือตัวอักษร เป็นต้น
ในรูปแบบ N Symbol

รูปเเบบ Output
จุดยอดสุดของพีระมิดต้องอยู่จุดกึ่งกลาง
ทุกสัญลักษณ์ที่อยู่ในชั้นเดียวกันจะมีการเว้นวรรณตามตัวอย่าง
ข้อจำกัด

0 < N < 20

ตัวอย่างที่1
Input:
3 *

Output:
  *
 * *
* * *

ตัวอย่างที่2
Input:
5 $

Output:

    $
   $ $
  $ $ $
 $ $ $ $
$ $ $ $ $

ตัวอย่างที่3
Input:
4 P

Output:
   P
  P P
 P P P
P P P P
'''

