'''
คำอธิบาย
เรียนรู้ผ่านโจทย์ :
ลูกค้าประจำอย่างลุงสมหมายนั้นเห็นเราที่พัฒนาโปรแกรมได้มากมายถึง 22 โปรแกรม ในเวลาอันสั้น ๆ จึงได้สนใจว่าจ้างเราอีกครั้ง
เพื่อให้เราพัฒนาโปรแกรมให้ลุงสมหมาย โดยเป็นโปรแกรมเก็บข้อมูลลูกค้าเช่นเดิม แต่แน่นอนว่า ลูกค้าของลุงสมหมายนั้น เพิ่มขึ้น ถึง 10 เท่าในระยะเวลาอันสั้น จากเดิมมีลูกค้าเค้าร้านวันละ 1 คน กลายเป็นวันละ 10 คนเพื่อซื้อของชำจากลุง โดยให้เราพัฒนาโปรแกรม สำหรับเก็บข้อมูล พร้อมทั้งแสดงผลของลูกค้าคนหนึ่ง ๆ ออกมาผ่านหน้าจอ โดยให้ทำการกรอกจำนวนของลูกค้าที่ต้องการกรอกลงไป และ เก็บข้อมูลดังนี้

บรรทัดแรกสุด : จำนวนลูกค้าที่ต้องกรอกทั้งหมด
บรรทัดที่ 1 : ชื่อ นามสกุลลูกค้า
บรรทัดที่ 2 : ปีเกิดของลูกค้า
บรรทัดที่ 3 : เพศของลูกค้า

โดยทำการรับค่าวนไปเรื่อย ๆ จนครบจำนวนลูกค้าทั้งหมดที่ได้ทำการกรอกเข้าระบบ และ ทำการแสดงผลข้อมูลของลูกค้าดังนี้
บรรทัดที่แรกสุด : แสดงข้อความ "--Customers Information--"
บรรทัดที่ 1 : ชื่อ นามสกุล พร้อมทั้ง อายุของลูกค้า เช่น "Kittikorn P (age : 12)"

โดยให้ยึดปีปัจจุบันเป็นปี 2017 ให้เราพัฒนาโปรแกรมดังกล่าว โดยดูตัวอย่างได้จากกรณีทดสอบด้านล่าง

คำใบ้ ความรู้เพิ่มเติม : สำหรับโจทย์ข้อนี้จะมีความแตกต่างระหว่าง การใช้ Scanner.next() กับ nextLine() นะครับ โดยที่

.next() จะเป็นการรับค่า ๆ หนึ่ง ตั้งแต่ตัวข้อความตัวแรกไปเรื่อย ๆ และ จะหยุดเมื่อเจอ เว้นวรรค์ (Space bar) เช่น รับค่า "AA BB" การใช้ .next() จะรับไปแค่ "AA" เท่านั้น
.nextLine() จะเป็นการรับทั้งหมด เช่น Input มาเป็น "AA BB" จะนำทั้งหมดไปเก็บหรือประมวลผลต่อเลย ทั้งบรรทัด

ตัวอย่างที่1
Input:
3 // บรรทัดแรกสุดบอกจำนวนลูกค้า
K P //ลูกค้าคนที่ 1
1990
Male
A A //ลูกค้าคนที่ 2
2010
Male
Sommai KraiMakMak //ลูกค้าคนที่ 3
1950
Male

Output:
--Customers Information--
K P (age : 27)
A A (age : 7)
Sommai KraiMakMak (age : 67)
'''
num = int(input())

inform = [input() for i in range(num*3)]

name = inform[::3]
age = inform[1::3]
age = list(map(lambda x: 2017 - int(x), age))
gender = inform[2::3]

print("--Customers Information--")
for i, j in zip(name, age):
  print(f"{i} (age : {j})")
