'''
คำอธิบาย
จงเขียนโปรแกรมเพื่อตรวจสอบว่าจำนวนที่รับเข้ามา เกิดจากจำนวนเต็มตัวใดตัวหนึ่งยกกำลัง 2 หรือไม่

รูปเเบบ Input
รับจำนวนเต็มเข้ามา 1 ตัว

รูปเเบบ Output
ถ้าเกิดจากจำนวนเต็มตัวใดตัวหนึ่งยกกำลัง 2 ให้แสดงจำนวนเต็มนั้นออกมา(โดยไม่มีจุดทศนิยม)
ถ้าไม่ใช่ ให้แสดงคำว่า false

ข้อจำกัด
ข้อยกเว้นคือ ถ้า input เท่ากับ -1 ให้แสดงตัว i ออกมมา

ตัวอย่างที่1
Input:
25

Output:
5
'''
import math


sq = int(input())

if sq >= 0:
  rsq = math.sqrt(sq)
  if rsq%1 ==0:
    print(int(rsq))
  else:
    print("false")
elif sq == -1:
  print('i')
else:
  print("false")
  
