'''
คำอธิบาย
ธนาคารแห่งหนึ่งให้กำหนดกฎเกณฑ์ในการกดเงินจากตู้ ATM ดังนี้
- กดเงินได้ครั้งละไม่เกิน 20,000 บาท และกดได้ 2 ครั้ง (หากครั้งที่ 2 ไม่กดให้ใส่ 0)
- ตู้ ATM จะจ่ายเงินในรูปแบบธนบัตรใบละ 1,000 500 และ 100 บาท และจะจ่ายธนบัตรที่มีค่ามากที่สุดก่อน
เช่น ครูโจ๊กต้องการไปกดเงิน 2 ครั้ง ครั้งแรกกดเงิน 15,900 บาท และครั้งที่ 2 กดเงิน 5,700 บาท
ครูโจ๊กจะได้ธนบัตรใบละ 1,000 บาทจำนวน 21 ใบ ธนบัตรใบละ 500 บาท จำนวน 1 ใบ และธนบัตรใบละ 100 บาท จำนวน 1 ใบ
แต่ถ้าผู้กดเงินกรอกจำนวนเงินเกิน โปรแกรมจะแสดงข้อความแจ้งเตือน (Error)

รูปเเบบ Input
บรรทัดที่ 1 : เงินที่ต้องการกดครั้งที่ 1
บรรทัดที่ 2 : เงินที่ต้องการกดครั้งที่ 2

รูปเเบบ Output
บรรทัดที่ 1 : จำนวนเเบงค์ 1000 ที่ตู้จ่ายเรามา
บรรทัดที่ 2 : จำนวนเเบงค์ 500 ที่ตู้จ่ายเรามา
บรรทัดที่ 3 : จำนวนเเบงค์ 100 ที่ตู้จ่ายเรามา

ตัวอย่างที่1
Input:
15000
1700

Output:
16
1
2

ตัวอย่างที่2
Input:
15800
0

Output:
15
1
3

ตัวอย่างที่3
Input:
30000
100

Output:
Error
'''

t1, t2 = [int(input()) for i in range(2)]

b_1000 = 0
b_500 = 0
b_100 = 0

def cal(x):
  global b_100, b_500, b_1000
  
  while True:
    if x >= 1000:
      b_1000 += x//1000
      x = x%1000
      #print(b_1000)
      
    elif x>= 500:
      b_500 += x//500
      x = x%500 
      
    elif x>= 100:
      b_100 +=  x//100
      x = x%100
      
    else:
      break


if (t1 or t2) > 20000:
  print("Error")
else:
  cal(t1+t2)
  #cal(t2)
  print(b_1000)
  print(b_500)
  print(b_100)
