'''
คำอธิบาย
รัฐบาลของประเทศกะลาแลนด์ได้ออกกฎหมายเกี่ยวกับการจ่ายภาษีรายได้ต่อปีไว้ดังนี้
ถ้ามีรายได้ตั้งแต่ 0-100000 กะลา ไม่ต้องจ่ายภาษี
ถ้ามีรายได้ตั้งแต่ 100001-300000 กะลา ต้องจ่ายภาษี 10%
ถ้ามีรายได้ตั้งแต่ 300001-500000 กะลา ต้องจ่ายภาษี 15%
ถ้ามีรายได้ตั้งแต่ 500001-1000000 กะลา ต้องจ่ายภาษี 20%
ถ้ามีรายได้มากกว่า 1000000 กะลา ต้องจ่ายภาษี 25%
โดยที่ครอบครัวของคุณประหยัดมีสมาชิก n คน ให้หาว่าครอบครัวนี้ต้องจ่ายภาษีรวมเท่าไหร่

รูปเเบบ Input
บรรทัดที่ 1 รับค่าจำนวนสมาชิกในครอบครัว
บรรทัดถัดมารับค่ารายได้ (เป็นจำนวนเต็ม) ของสมาชิกในครอบครัวจนครบทุกคน

รูปเเบบ Output
เสียภาษีทั้งหมด x กะลา
ถ้าเสียภาษี 0 กะลาให้แสดงว่า "ไม่ต้องเสียภาษี"

ข้อจำกัด
ถ้ามีเศษให้ปัดลง

ตัวอย่างที่1
Input:
3
100000
340000
250000

Output:
เสียภาษีทั้งหมด 76000 กะลา

ตัวอย่างที่2
Input:
4
230000
1000000
1200000
860000

Output:
เสียภาษีทั้งหมด 695000 กะลา

ตัวอย่างที่3
Input:
2
100000
80000

Output:
ไม่ต้องเสียภาษี
'''
member = int(input())
get = [int(input()) for i in range(member)]

tax_total = 0

def tax(get):
  global tax_total 
  for taxs in get:
    if taxs <= 100000:
      pass
    elif taxs >= 100001 and taxs <= 300000:
      tax_total += taxs*(0.1)
    elif taxs >= 300001 and taxs <= 500000:
      tax_total += taxs*(0.15)
    elif taxs >= 500001 and taxs <= 1000000:
      tax_total += taxs*(0.20)
    else:
      tax_total += taxs*(0.25)
      
if __name__ == "__main__":      
  tax(get)
  if tax_total ==0:
    print("ไม่ต้องเสียภาษี")
  else:
    print(f"เสียภาษีทั้งหมด {int(tax_total)} กะลา")
