'''
คำอธิบาย
โจทย์ข้อนี้ไม่ได้เกี่ยวกับเทอ แต่เกี่ยวกับกาแฟ . . .
โดยโจทย์ต้องการให้หาจำนวนมดที่จะขึ้นมาบนแก้วกาแฟถ้าหากน้ำตาลมีดังนี้

-น้ำตาล 1 กรัม มดจะขึ้น 10 ตัว
-น้ำตาล 2 กรัม มดจะขึ้น 20 ตัว
-น้ำตาล 3 กรัม มดจะขึ้น 40 ตัว
-น้ำตาล 4 กรัม มดจะขึ้น 80 ตัว

รูปเเบบ Input
ปริมาณน้ำตาล (กรัม) เป็นจำนวนจริง

รูปเเบบ Output
จำนวนมดทั้งหมดที่ขึ้นแก้วกาแฟ (ตัว)

ข้อจำกัด
อกหักต้องมีไก่หมัก อกหมักต้องมีไก่หัก (ไม่เกี่ยวไรหรอก)
อย่าลืมว่า!!! ถ้าไม่มีน้ำตาล มดจะไม่ขึ้น!

ตัวอย่างที่1
Input:
1

Output:
10

ตัวอย่างที่2
Input:
2.5

Output:
30

ตัวอย่างที่3
Input:
3.5

Output:
60
'''
sugar = float(input())

def calculate():
  if sugar == 0:
    print(0)
  elif sugar % int(sugar) == 0:
    print(int(10 * (2**(sugar-1))))
  else:
    rest = sugar - int(sugar) 
    dif = 10 * (2**(int(sugar))) - 10 * (2**(int(sugar)-1)) 
    original = 10 * (2**(int(sugar-1)))
    result_dif = dif *rest
    print(int(original + result_dif))

if __name__ == "__main__":
  calculate()
