'''
คำอธิบาย
Towers
ให้เขียนโปรแกรมที่รับแถว ที่มีตึกความสูงต่างๆ เรียงรายกันอยู่
จากนั้นจะให้ผู้สังเกตยืนอยู่ด้านซ้าย แล้วตอบว่า ถ้าหากมองจากซ้ายไปขวา
จะเห็นยอดตึกได้ทั้งหมดกี่ตึก

รูปเเบบ Input
เป็นแถวของตึกที่มีความสูงต่างๆ
รูปแบบ Output
เป็นจำนวนตึกที่ผู้สังเกตจะมองเห็น
ข้อจำกัด
ไม่สนใจองศาของการมอง หรือมุมเงย มุมก้ม หรือกฏของฟิสิกส์ใดๆ

ตัวอย่างที่ 1
ข้อมูลขาเข้า
4 5 1 3 7

ผลลัพธ์
3

#คำอธิบาย
# จะมองเห็นยอดของตึกที่สูง 4,5,7 เท่านั้น
# ตึกที่สูง 1 และสูง 3 ถูกตึกที่ 5 บังอยู่ 
# มองไม่เห็นยอดตึกดังกล่าว

ตัวอย่างที่ 2
ข้อมูลขาเข้า
8 5 5 8 9 10 9 8

ผลลัพธ์
3

ตัวอย่างที่ 3
ข้อมูลขาเข้า
10 10 10 10 10 10 10 10

ผลลัพธ์
1
'''

town_build = input().split(" ")
town_build = list(map(lambda x: int(x), town_build))

count = 1
max = town_build[0]

for i in town_build[1:]:
  if i > max:
    max = i
    count += 1

print(count)
