'''
คำอธิบาย
จงคำนวนพื้นที่ 3 เหลี่ยม
สุตร: 1/2 * ฐาน * สุง
หากได้ผลลัพธ์เป็นทศนิยมให้ตอบเป็นทศนิยม 1 ตำแหน่ง หากไม่ได้ทศนิยม ให้ตอบเป็นจำนวนเต็ม

รูปเเบบ Input
บรรทัดที่ 1 ความยาวฐาน
บรรทัดที่ 2 ความสูง

รูปเเบบ Output
บรรทัดที่ 1 พื้นที่ 3 เหลี่ยม
หากได้ผลลัพธ์เป็นทศนิยมให้ตอบเป็นทศนิยม 1 ตำแหน่ง หากไม่ได้ทศนิยม ให้ตอบเป็นจำนวนเต็ม

ตัวอย่างที่1
Input:
7
15

Output:
52.5 cm2

ตัวอย่างที่2
Input:
38
73

Output:
1387 cm2
'''

base, height = [int(input()) for i in range(2)]

result = 0.5*base*height

if result%1==0:
  print(f"{int(result)} cm2")
else:
  print(f"{result} cm2")

