'''
คำอธิบาย
ด.ช. สมชาย ได้เดินตากฝนระหว่างทาง เพราะต้องไปซื้อขวดน้ำปลาที่คุณแม่สั่ง ทำให้ไข้เกิดสูงขึ้น
คุณแม่จึงใช้เทอร์โมมิเตอร์กับสมชายเพื่อวัดอุณหภูมิของเขา แต่พอเห็นอุณหภูมิแม่ก็ตกใจว่าทำไมไข้ลูกถึงเป็น 39.1 องศาเซลเซียส!! เนื่องจากคุณแม่เป็นนักฟิสิกส์ เลยไม่รู้ว่าองศาเซลเซียสนั้นคือจำนวนเท่าไหร่ของเคลวิน คุณแม่จึงใช้งาน ด.ช. สมชาย อีกครั้งที่กำลังป่วยอยู่ ให้สร้างเครื่องมือแปลงอุณหภูมิจากองศาเซลเซียสเป็นเคลวินให้หน่อย เรามาช่วย ด.ช. สมชายด้วยกันเถอะ!!

รูปเเบบ Input
รับค่าตัวเลขเป็นทศนิยม

รูปเเบบ Output
ตัวเลขที่รับมา + 273.15

ตัวอย่างที่1
Input:
0

Output:
273.15

ตัวอย่างที่2
Input:
39.1

Output:
312.25

ตัวอย่างที่3
Input:
-30

Output:
243.15
'''
K = float(input())
C = K + 273.15

if C%1 == 0:
  print(int(C))
else:
  print(C)
