'''
คำอธิบาย
เกมแนว Turn-based หรือเกมแนวผลัดกันตีคนละรอบ อธิบายง่ายๆคือใน 1 รอบ เรากับศัตรูจะแลกหมัดกัน
เมื่อเข้าสู่การต่อสู้ คุณเกิดสงสัยว่าเราจะชนะศัตรูได้หรือไม่จึงอยากเขียนโปรแกรมขึ้นมา
โจทย์ : ให้คำนวณว่าคุณจะชนะการต่อสู้กับศัตรูหรือไม่
กำหนดให้ รับค่าทั้งหมด 4 ค่าได้แก่
1. พลังชีวิตของคุณ
2. พลังชีวิตของศัตรู
3. ความเสียหายที่คุณทำต่อศัตรูและทำให้พลังชีวิตของศัตรูลดลงใน 1 รอบ
4. ความเสียหายที่ศัตรูทำต่อเราและทำให้พลังชีวิตของคุณลดลงใน 1 รอบ
และกำหนดให้ทุกรอบที่หารด้วย 3 ลงตัว เราจะทำความเสียหายแบบคริติคอล คือแรงขึ้น 1.5 เท่าของความเสียหายที่คุณทำต่อศัตรูใน 1 รอบ

รูปเเบบ Input
บรรทัดแรก : รับค่าตัวเลข 2 ค่า คือ พลังชีวิตของคุณ และ พลังชีวิตของศัตรู (เว้นวรรค 1 ช่อง)
บรรทัดที่สอง : รับค่าตัวเลข 2 ค่า คือ ความเสียหายที่คุณทำต่อศัตรูใน 1 รอบ และ ความเสียหายที่ศัตรูทำต่อเราใน 1 รอบ (เว้นวรรค 1 ช่อง)

รูปเเบบ Output
บรรทัดแรกบรรทัดเดียว : ให้แสดงคำว่า "You Win" ถ้าหากพลังชีวิตของศัตรูมีค่าเท่ากับ 0 ก่อนคุณ
แสดงคำว่า "You Lose" ถ้าหากพลังชีวิตของเรามีค่าเท่ากับ 0 ก่อนศัตรู

ข้อจำกัด
กำหนดให้เราเป็นฝ่ายได้ทำความเสียหายต่อศัตรูก่อนเสมอ
กำหนดให้ค่าพลังชีวิตทั้งของเราและศัตรูมีค่ามากกว่าหรือเท่ากับ 0
กำหนดให้ความเสียหายทั้งที่เราทำและศัตรูทำมีค่ามากกว่า 0

ตัวอย่างที่1
Input:
100 100
15 20

Output:
You Lose

ตัวอย่างที่2
Input:
80 100
16 15.7

Output:
You Win

ตัวอย่างที่3
Input:
10 10
1.6 2

Output:
You Lose
'''
h_y, h_e = input().split(" ")
d_y, d_e = input().split(" ")

h_y, h_e, d_y, d_e = float(h_y), float(h_e), float(d_y), float(d_e)

def battle():
  count_round = 1
  global  h_y, h_e, d_y, d_e
  while True:
    if count_round % 3 == 0:
      h_e -= d_y*1.5
      h_e = round(h_e, 2)
    else:
      h_e -= d_y
      h_e = round(h_e, 2)
    if h_e <=0:
      return "You Win"
    h_y -= d_e
    h_y = round(h_y, 2)
    if h_y <=0:
      return "You Lose"
    count_round += 1
    
print(battle())
