'''
คำอธิบาย
นายป.และผองเพื่อนได้นั่งเล่นเกมนับเลขแบบชิวๆ
โดยเลขที่นับนั้นจะเริ่มนับเลขแรกด้วยเลข 1 และตัวต่อไปจะเป็นจำนวนที่มีตัวประกอบ 3 11 19 (เลขที่นับจะประกอบด้วย 3 หรือ 11 หรือ 19 เท่านั้น) ตามลำดับจากน้อยไปมากไปเรื่อยๆ
แต่เนื่องจากนายป. นั้นเป็นคนที่นับเลขค่อนข้างจะช้าจึงขอให้คุณที่เป็นโปรแกรมเมอร์สุดโหดช่วยหาลำดับ n ของเลขที่ต้องนับ

ตัวอย่างเช่น
n = 10

จำนวนตามลำดับคือ
1 (1)
3 (3)
9 (3*3)
11 (11)
19 (19)
27 (3*3*3)
33 (3*11)
57 (3*19)
81 (3*3*3*3)
99 (3*3*11)

ดังนั้นจำนวนตัวที่ 10 คือ 99
รูปเเบบ Input
บรรทัดเดียวรับจำนวนเต็มบวก n คือลำดับที่ต้องการ
1 <= n <= 100

รูปเเบบ Output
บรรทัดเดียวแสดงจำนวนของตัวเลขลำดับนั้นๆ

ตัวอย่างที่1
Input:
10

Output:
99

ตัวอย่างที่2
Input:
30

Output:
3249

ตัวอย่างที่3
Input:
45

Output:
14641
'''
number = int(input())

def is_ugly(num):
  if num <= 0:
    return False

  if num == 1:
    return True

  while num % 3 == 0:
    num /= 3
  while num % 11 == 0:
    num /= 11
  while num % 19 == 0:
    num /= 19

  return num == 1

list_ugly = []
count = 0
while len(list_ugly) < number:
  if is_ugly(count):
    list_ugly.append(count)
  count += 1
  
print(list_ugly[-1])
