'''
คำอธิบาย
คุณได้เป็นวิทยากรไปสอนภาษา C ให้กับเด็กประถมในชนบทแห่งหนึ่ง เนื่องจากเวลาในการสอนน้อย จึงทำให้สอนได้แค่ printf เท่านั้น

	รูปแบบการใช้ printf หากไม่รู้ 
	format: printf("ข้อความ");
เพราะว่าเวลาสอนน้อย ทำให้สอนได้แค่การใส่ข้อความตรง ๆ แล้วแสดงเท่านั้น ไม่ได้สอนการขึ้นบรรทัดใหม่ การแทนตัวแปร หรืออย่างอื่นนอกเหนือจากการแสดงผลแบบเบื้องต้นเท่านั้น

คุณได้ให้งานเด็กประถมโดยการแสดงผลอะไรก็ได้ แต่ขอให้สิ่งที่แสดงผลมีได้แค่ A-Z, a-z, ตัว spacebar และ 0-9 เท่านั้น เด็กบางคนก็อาจจะเขียนไม่เป็น เลยเขียนมั่ว ๆ มา และเด็กเหล่านี้จะส่ง code ของเขาให้ตลอดเวลาจนตรวจไม่ทัน ดังนั้นงานของคุณคือเขียนโปรแกรมตรวจสอบการเขียน code ของเด็กประถมว่าถูกต้องหรือไม่

	----------ตัวอย่างการแสดงผลผิด เช่น----------

เขียน printf ผิดหรือไม่ครบ : printg("Hello world");
ใส่วงเล็บเกินหรือขาด : printf("Hello world"));
ใส่ฟันหนู (") เกินหรือขาด หรือใส่ฝนทอง (') มาเกินหรือแทนฟันหนู: printf('Hello world');
ใส่อัฒภาค (semi colon) (;) มาเกินหรือไม่ได้ใส่: printf("Hello world")
ใส่สิ่งแปลกปลอม ทำให้ไม่สามารถ compile ได้: printf("Hello world"!!!!!);
และนอกเหนือจากนี้ยังมีอีกเยอะ
(สิ่งที่สามารถอนุโลมให้คือ การเขียน space bar หน้า printf ไม่ว่าจะกี่ตัวก็ตามจะถือว่าไม่นับเป็นตัวอักษรเกินของ printf เช่น "      printf("Hello world");" จะผ่าน)
รูปเเบบ Input
มีบรรทัดเดียว รับ code printf ของเด็กประถม

รูปเเบบ Output
มีบรรทัดเดียว

ถ้า code ถูกต้อง ให้แสดงผลสิ่งที่เด็กประถมได้เขียนเอาไว้ (print คำนั้นออกมา)
ถ้า code ไม่ถูกต้อง ให้แสดงผลคำว่า "Compile Error!"
ข้อจำกัด
 รับประกันว่าในข้อความที่จะแสดงผลมีได้แค่ A-Z, a-z, ตัว spacebar และ 0-9 เท่านั้น และยาวไม่เกิน 100 ตัวอักษร
ปล. Example ที่มีตัวนี้ (\) ถือว่าไม่มีนะครับ Example รู้สึกจะ bug แปลก ๆ 


ตัวอย่างที่1
Input:
printf(\"Hello world\");

Output:
Hello world

ตัวอย่างที่2
Input:
pintf(\"Test\");

Output:
Compile Error!

ตัวอย่างที่3
Input:
printf(Testing);

Output:
Compile Error!
'''
text = input()
text = text.strip()

'''
if text[:8] == "printf(\"" and text[-3:] == '");' :
  print(text[8:-3])
else:
  print("Compile Error!")

'''

print(text[8:-3])  if text[:8] == "printf(\"" and text[-3:] == '");' else print("Compile Error!")
#print(text[:8], text[-3:])
