'''
คำอธิบาย
เด็กหญิงมิ้น ต้องการไปประเทศจีน แต่เด็กหญิงมิ้น ไม่รู้ว่าต้องแลกเงินไปกี่บาทถึงจะพอใช้
เราผู้เป็นโปรแกรมเมอร์ผู้ชาญฉลาด จึงได้ช่วยเด็กหญิงมิ้น ซึ่งไม่ได้อยากช่วย แต่น้องแกต้องการให้เราช่วย ดังนั้น เราจึงต้องเขียนโปรแกรมคำนวณค่าเงินให้เด็กหญิงมิ้น

กำหนดให้อัตราแลกเปลี่ยน 1 Yuan = 4 Baht
รูปเเบบ Input
รับค่าจำนวนเงินมา เป็นจำนวนเต็ม ตามด้วยหน่วยของเงิน เช่น 100 Yuan

รูปเเบบ Output
แสดงผลเป็นค่าเงินที่แปลงออกมาแล้ว เป็นจำนวนเต็ม เช่น 400 Baht

ตัวอย่างที่1
Input:
4600 Yuan

Output:
18400 Baht
'''
a = input()
b = a.split(" ")
b = int(b[0])

print(f"{b*4} Baht")
